[
  {
    "productName": "Season Kin Snowboard 2023",
    "price": "$499.00",
    "url": "https://www.evo.com/snowboards/season-kin-snowboard",
    "details": {
      "description": "Spend a season in the park and you'll see why the rail sliders, box boopers, and jump line maniacs think of themselves as family. Day after day honing skills, hollering encouragement, and picking your homies up off the snow to have another crack at nailing that. one. friggin'. trick. It shifts your perception of what matters, of why we do the things we do. The Season Kin Snowboard is a directional twin shape for the whole freestyle fam - men, women, young, and old. It has symmetrical camber for added grip and energy, a playful, pressable flex, and durable construction engineered to stand up to everyday abuse in the park and beyond.",
      "terrain": "Freestyle, All-Mountain",
      "abilityLevel": "Intermediate-Advanced",
      "rockerType": "Camber",
      "shape": "Directional Twin",
      "flexRating": "Soft",
      "materials": "Wood",
      "warranty": "Limited Lifetime"
    }
  },
  {
    "productName": "Season Nexus Snowboard 2024",
    "price": "$549.00",
    "url": "https://www.evo.com/snowboards/season-nexus-snowboard",
    "details": {
      "description": "The Season Nexus Snowboard stands out in the arms race of bloated quivers and technical jargon - a simple skeleton key capable of unlocking the innate potential of any day in the mountains. Its straightforward geometry cuts through the noise, creating something that adds up to much more than the sum of its parts. Ample float in powder, smooth, engaged turns on hardpack, and dependable performance in everyday resort chop. It’s the ultimate quiver of one - more than enough to remind you why you fell in love with snowboarding in the first place.",
      "terrain": "All-Mountain, Freeride",
      "abilityLevel": "Intermediate-Advanced",
      "rockerType": "Rocker/Camber/Rocker",
      "shape": "Directional Twin",
      "flexRating": "Medium",
      "materials": "Wood",
      "warranty": "Limited Lifetime"
    }
  },
  {
    "productName": "Arbor Cadence Rocker Snowboard - Women's",
    "price": "$449.95",
    "url": "https://www.evo.com/outlet/snowboards/arbor-cadence-rocker-snowboard-womens-2023",
    "details": {
      "description": "Inhale the sweet frozen air, put on your favorite tunes, and get into the groove with your new Arbor Cadence Rocker Snowboard. Designed to mold to whatever riding style you boast, this park board with an all mountain flair effortlessly adapts to the pops, jumps, and switch tricks you're throwing out into the world. With traditional tattoo inspired art lovingly created by Canadian Hilary Jane, this gorgeous platform is more than just good for the planet, it's good for your soul.",
      "terrain": "Freestyle, All-Mountain",
      "abilityLevel": "Intermediate-Advanced",
      "rockerType": "Rocker",
      "shape": "True Twin",
      "flexRating": "Medium",
      "materials": "Wood",
      "warranty": "3 Years"
    }
  },
  {
    "productName": "K2 Raygun Pop Snowboard 2023",
    "price": "$429.95",
    "url": "https://www.evo.com/snowboards/k2-raygun-pop-snowboard",
    "details": {
      "description": "The K2 Raygun Pop Snowboard is a point-and-shoot all-mountain snowboard for the people. This smooth-flexing directional twin comes with a cambered shape for great edge hold and plenty of pop. It's accessible for beginner riders to learn on, but backed with high quality construction and a versatile shape that also makes it perfect for intermediate riders that like to mix it up on a variety of terrain. Wherever your voyage takes you, don't forget to bring your Raygun.",
      "terrain": "All-Mountain",
      "abilityLevel": "Beginner-Intermediate",
      "rockerType": "Rocker/Camber/Rocker",
      "shape": "Directional Twin",
      "flexRating": "Medium",
      "materials": "Carbon, Wood",
      "warranty": "3 Years"
    }
  },
  {
    "productName": "Arbor Cadence Camber Snowboard - Women's",
    "price": "$449.95",
    "url": "https://www.evo.com/outlet/snowboards/arbor-cadence-camber-snowboard-womens-2023",
    "details": {
      "description": "The Arbor Cadence Camber Snowboard is one of pure passion, made to compliment the flow of your body, adapt to street styles smooth or playful, and provide a harmonic all around shred platform that excels everywhere on the mountain. Made with highly responsive system camber that pushes as hard as you can take it and tattoo-inspired graphics by artist Hilary Jane; the Cadence is good for mother earth, your body, and the sport which you lovingly give your time.",
      "terrain": "Freestyle, All-Mountain",
      "abilityLevel": "Intermediate-Advanced",
      "rockerType": "Camber",
      "shape": "True Twin",
      "flexRating": "Soft",
      "materials": "Wood",
      "warranty": "3 Years"
    }
  },
  {
    "productName": "Arbor Coda Rocker Snowboard",
    "price": "$599.95",
    "url": "https://www.evo.com/outlet/snowboards/arbor-coda-rocker-snowboard-2023",
    "details": {
      "description": "In music, a coda wraps up a song. Put a bow on it and lets you know \"we're done here.\" The Arbor Coda Rocker Snowboard isn't the end of snowboarding design, but it's pretty dang perfect. This legendary big mountain twin is built from the ground up with sustainable materials and manufacturing processes: recycled steel edges, recycled ABS sidewalls, biodegradable wax, and most notably of all, the Rise Above Plastics topsheet Everything about the Coda is exquisitely crafted for performance, beauty, and sustainability, never sacrificing one for the sake of the other. And that balanced design carries over to the ride characteristics of the Arbor Coda Rocker Snowboard. It's a twin shaped board that's a pure joy to ride in any conditions, but particularly shines when brought to play with big snow, big features, and big speed. Available in Camber and Rockered Versions. The End.",
      "terrain": "All-Mountain, Freeride",
      "abilityLevel": "Advanced-Expert",
      "rockerType": "Camber",
      "shape": "Directional Twin",
      "flexRating": "Medium",
      "materials": "Bamboo, Wood",
      "warranty": "3 Years"
    }
  },
  {
    "productName": "Arbor Veda Camber Snowboard - Women's",
    "price": "$549.95",
    "url": "https://www.evo.com/outlet/snowboards/arbor-veda-camber-snowboard-womens",
    "details": {
      "description": "The Arbor Veda Snowboard is an absolute ripper. This directional big mountain board was shaped by Marie-France Roy, and it's her ride of choice for lines of high consequence. It has a slightly tapered, setback shape that floats well in deeper snow, as well as long lines, a sturdy flex, and a full camber profile that generates plenty of power and response when you need it most. To finish it off, the board is made with Arbor's signature commitment to sustainability, featuring a plastic-free topsheet that highlights the beautiful and unique woodgrain patterns of the Cedar Powerply.",
      "terrain": "All-Mountain, Freeride, Powder",
      "abilityLevel": "Advanced-Expert",
      "rockerType": "Camber",
      "shape": "Directional",
      "flexRating": "Medium",
      "materials": "Wood",
      "warranty": "3 Years"
    }
  },
  {
    "productName": "Arbor Formula Camber Snowboard",
    "price": "$449.95",
    "url": "https://www.evo.com/outlet/snowboards/arbor-formula-camber-snowboard-2023",
    "details": {
      "description": "The best formulas are pretty simple. Peanut butter and jelly, pizza and beer, and there's probably even some non-food combos that are successful. The Arbor Formula Camber Snowboard utilizes one such recipe: an all mountain twin shape, a manageable flex, and a lively core. Pointy swallowtails and pure park boards are great, but take them out of their element and their shine dulls a bit. The Formula leverages decades of real life results and decides not to mess with what works. Pick your size and call it good: your board is going to rip today!",
      "terrain": "All-Mountain",
      "abilityLevel": "Intermediate-Advanced",
      "rockerType": "Camber",
      "shape": "Directional Twin",
      "flexRating": "Medium",
      "materials": "Wood",
      "warranty": "3 Years"
    }
  },
  {
    "productName": "Arbor Swoon Camber Snowboard - Women's",
    "price": "$549.95",
    "url": "https://www.evo.com/outlet/snowboards/arbor-swoon-camber-snowboard-womens-2023",
    "details": {
      "description": "The Arbor Swoon Camber Snowboard is an all-around board for expert riders. It has an exceptionally well-balanced twin shape and a fully cambered profile, making it a blast for blasting through chunder or blasting off to the moon. It floats beautifully through powder, cuts with scalpel-like precision through technical terrain and provides tons of energy and snappy response for playing with speed and turn shapes on mellower runs.",
      "terrain": "All-Mountain, Freeride",
      "abilityLevel": "Advanced-Expert",
      "rockerType": "Camber",
      "shape": "Directional Twin",
      "flexRating": "Medium",
      "materials": "Wood",
      "warranty": "3 Years"
    }
  },
  {
    "productName": "Rome Warden Snowboard",
    "price": "$429.95",
    "url": "https://www.evo.com/outlet/snowboards/rome-warden-snowboard",
    "details": {
      "description": "The Rome Warden Snowboard takes a no-nonsense approach to snowboarding, with tried-and-true technologies that just work. The directional twin shape and medium flex are capable anywhere on the mountain and the Fusion Camber combines the power of positive camber with the smoothness of rocker. Bamboo HotRods are made for presses and jumps and the fast and durable PowerSlide base is perfect for intermediate riders looking for a board that'll rip season after season.",
      "terrain": "All-Mountain",
      "abilityLevel": "Intermediate-Advanced",
      "rockerType": "Rocker/Camber/Rocker",
      "shape": "Directional Twin",
      "flexRating": "Medium",
      "materials": "Bamboo, Wood",
      "warranty": "2 Years"
    }
  },
  {
    "productName": "Ride Heartbreaker Snowboard - Women's",
    "price": "$419.95",
    "url": "https://www.evo.com/outlet/snowboards/ride-heartbreaker-snowboard-womens-2023",
    "details": {
      "description": "Simple, smooth, and multi-directional. The Ride Heartbreaker Snowboard is an entry level twin shape with a soft flex, dependable feel, and easy riding characteristics that make it a winner for progression in the park on across the mountain. If you are looking for a board that will have you riding better in no time, and possibly have an eye on the freestyle features, this is the one for you.",
      "terrain": "All-Mountain",
      "abilityLevel": "Beginner-Intermediate",
      "rockerType": "Rocker/Camber/Rocker",
      "shape": "True Twin",
      "flexRating": "Soft",
      "materials": "Wood",
      "warranty": "3 Years"
    }
  },
  {
    "productName": "Salomon Wonder Snowboard - Women's",
    "price": "$429.95",
    "url": "https://www.evo.com/outlet/snowboards/salomon-wonder-snowboard-womens-2023",
    "details": {
      "description": "Have you ever wondered what lies off the groomed path? The Salomon Wonder Snowboard is ready to explore with you, whether you're crossing sidecountry gates or ducking into trees and gullies. Rock Out Camber with Ghost Basalt Stringers is stable and responsive and the cork sidewalls dampen vibrations in less-than-ideal conditions. It's a wonder you've lived so long without it!",
      "terrain": "Freestyle, All-Mountain",
      "abilityLevel": "Intermediate-Advanced",
      "rockerType": "Rocker/Camber/Rocker",
      "shape": "Directional Twin",
      "flexRating": "Medium",
      "materials": "Basalt, Cork, Wood",
      "warranty": "2 Years"
    }
  },
  {
    "productName": "Lib Tech Skate Banana BTX Snowboard - Blem",
    "price": "$559.99",
    "url": "https://www.evo.com/outlet/snowboards/lib-tech-skate-banana-btx-snowboard-blem",
    "details": {
      "description": "The board that started it all. The Lib Tech Skate Banana BTX Snowboard was the originator of Lib Tech's signature Banana rocker technology. By placing cambered pockets under each foot with a rockered section in the middle, the Skate Banana lets you pop and pivot at will, enjoying all the benefits of both rocker and camber. With Magne-Traction enhanced edging on groomers and a park ready twin profile, this board is simple, intuitive, and ready to do it all in the resort. *Please Note: This is a factory blem product and may have slight cosmetic issues that do not impact performance.*",
      "terrain": "Freestyle, All-Mountain",
      "abilityLevel": "Beginner-Intermediate",
      "rockerType": "Camber/Rocker/Camber",
      "shape": "True Twin",
      "flexRating": "Soft",
      "materials": "Wood",
      "warranty": "1 Year"
    }
  },
  {
    "productName": "Lib Tech Cortado C2 Snowboard - Women's",
    "price": "$529.99",
    "url": "https://www.evo.com/outlet/snowboards/lib-tech-cortado-c2-snowboard-womens-2023",
    "details": {
      "description": "No worries, easy handling, and smooth riding are what make the Lib Tech Cortado C2 Snowboard so great. This all-around all-mountain ride does it all with style and simplicity. It has a slightly tapered shape with just a bit of setback in the stance for control and power down groomers and steeps, but it's balanced with a forgiving-yet-firm flex profile and poppy tail that allow for playful creative riding when the mood hits you. Just like a well-made Cortado, this board is approachable, balanced, and totally delicious.",
      "terrain": "All-Mountain",
      "abilityLevel": "Intermediate-Advanced",
      "rockerType": "Camber/Rocker/Camber",
      "shape": "Directional",
      "flexRating": "Medium",
      "materials": "Wood",
      "warranty": "1 Year"
    }
  },
  {
    "productName": "GNU Young Money C2E Snowboard - Big Boys'",
    "price": "$399.99",
    "url": "https://www.evo.com/outlet/snowboards/gnu-young-money-c2e-snowboard-big-boys",
    "details": {
      "description": "The GNU Young Money C2E Snowboard is built for the kids pushing it in the terrain park. It's a full featured freestyle deck that's exactly the same as the grownups' GNU Money, just in a smaller set of sizes. It's chock full of poppy, pivoty fun for any freestyle-minded rider. Plus, it's built with bombproof construction and materials so it can take a beating.",
      "terrain": "Freestyle",
      "abilityLevel": "Intermediate-Advanced",
      "rockerType": "Camber/Rocker/Camber",
      "shape": "True Twin",
      "flexRating": "Medium",
      "materials": "Wood",
      "warranty": "1 Year"
    }
  },
  {
    "productName": "Lib Tech Dynamo C3 Snowboard",
    "price": "$559.99",
    "url": "https://www.evo.com/outlet/snowboards/lib-tech-dynamo-c3-snowboard-2023",
    "details": {
      "description": "The Lib Tech Dynamo C3 Snowboard is a hand grenade ready to explode. This directional freeride firecracker combines the powerful C3 camber profile with a wide-nosed directional shape for ultimate power through any density of soft snow, as well as unlimited stompability off big cliffs and natural features. Despite the hard charging, directional nature of the design, it maintains the playful pivotability and freestyle feel that Lib Tech boards are known for. It's poppy, precise, and perfect for fall line freestyle antics and all around ferocious riding.",
      "terrain": "All-Mountain, Freeride",
      "abilityLevel": "Advanced-Expert",
      "rockerType": "Camber/Rocker/Camber",
      "shape": "Directional",
      "flexRating": "Stiff",
      "materials": "Wood",
      "warranty": "1 Year"
    }
  },
  {
    "productName": "Yes. Basic Snowboard - Women's",
    "price": "$429.95",
    "url": "https://www.evo.com/outlet/snowboards/yes-basic-snowboard-womens-2023",
    "details": {
      "description": "Sometimes the simplest things are the best, and the Yes. Basic Snowboard is no exception. Coming in with a versatile mid flex and classic CamRock profile, the Basic is a classic twin shape for riders of all stripes. This board will satisfy everyone from newbies learning the ropes to veterans tearing it up on the slopes.",
      "terrain": "Freestyle, All-Mountain",
      "abilityLevel": "Intermediate-Advanced",
      "rockerType": "Rocker/Camber/Rocker",
      "shape": "True Twin",
      "flexRating": "Medium",
      "materials": "Wood",
      "warranty": "Limited Lifetime"
    }
  },
  {
    "productName": "Jones Frontier Splitboard",
    "price": "$799.95",
    "url": "https://www.evo.com/outlet/splitboards/jones-frontier-splitboard",
    "details": {
      "description": "The Jones Frontier Splitboard is the board you'd want to ride every day, just cut in half. Combining floaty directional rocker with a freestyle-inspired tail and a playful flex, this board excels in the variable conditions you expect in the backcountry, but doesn't flounder when the stars align and you find yourself in deep pow. Traction Tech 2.0 edges ensure grip and stability when things are firm, whether arcing turns on the descent or side-hilling up an icy skin track. Float through the soft stuff, harvest the corn and hit every natural feature on the way down; the Jones Frontier Splitboard is the adventure companion you've been waiting for.",
      "terrain": "Splitboarding",
      "abilityLevel": "Intermediate-Advanced",
      "rockerType": "Rocker/Camber/Rocker",
      "shape": "Directional Twin",
      "flexRating": "Medium",
      "materials": "Wood",
      "warranty": "3 Years"
    }
  },
  {
    "productName": "GNU Ravish C2 Snowboard - Women's",
    "price": "$499.99",
    "url": "https://www.evo.com/outlet/snowboards/gnu-ravish-c2-snowboard-womens",
    "details": {
      "description": "The GNU Ravish C2 Snowboard is the perfect board for everyday cruising. It's smooth flexing, directional, and fun to ride, offering a great option for less aggressive riders who don't necessarily venture into the terrain park. The design of the Ravish is based on big mountain shapes that lend themselves to smooth power transfer and high speed stability, but toned down into an approachable package that brings lively fun to groomers, tree runs, back bowls, and powder laps, no matter your speed or skill level.",
      "terrain": "All-Mountain",
      "abilityLevel": "Intermediate-Advanced",
      "rockerType": "Camber/Rocker/Camber",
      "shape": "Directional",
      "flexRating": "Stiff",
      "materials": "Wood",
      "warranty": "1 Year"
    }
  },
  {
    "productName": "GNU B-Nice BTX Snowboard - Women's",
    "price": "$459.99",
    "url": "https://www.evo.com/outlet/snowboards/gnu-b-nice-btx-snowboard-womens-2023",
    "details": {
      "description": "Learning new things is hard. But it's a lot better if you have a good teacher. Someone that will be patient, be encouraging, and most of all be nice. The GNU B-Nice BTX Snowboard is just that teacher. It's a friendly, catch free all-mountain freestyle board that will take you from day 1 to pro in no time, with nothing but kindness and stoke along the way.",
      "terrain": "Freestyle, All-Mountain",
      "abilityLevel": "Beginner-Intermediate",
      "rockerType": "Camber/Rocker/Camber",
      "shape": "True Twin",
      "flexRating": "Soft",
      "materials": "Wood",
      "warranty": "1 Year"
    }
  },
  {
    "productName": "Lib Tech Skate Banana BTX Snowboard",
    "price": "$559.99",
    "url": "https://www.evo.com/outlet/snowboards/lib-tech-skate-banana-btx-snowboard-2023",
    "details": {
      "description": "The board that started it all. The Lib Tech Skate Banana BTX Snowboard was the originator of Lib Tech's signature Banana rocker technology. By placing cambered pockets under each foot with a rockered section in the middle, the Skate Banana lets you pop and pivot at will, enjoying all the benefits of both rocker and camber. With Magne-Traction enhanced edging on groomers and a park ready twin profile, this board is simple, intuitive, and ready to do it all in the resort.",
      "terrain": "Freestyle, All-Mountain",
      "abilityLevel": "Beginner-Intermediate",
      "rockerType": "Camber/Rocker/Camber",
      "shape": "True Twin",
      "flexRating": "Soft",
      "materials": "Wood",
      "warranty": "1 Year"
    }
  },
  {
    "productName": "Jones Dream Weaver Splitboard - Women's",
    "price": "$799.95",
    "url": "https://www.evo.com/outlet/splitboards/jones-dream-weaver-splitboard-womens",
    "details": {
      "description": "The splitboard formerly known as the Dream Catcher gets renamed, with dialed mid-flex performance, touring-friendly tech, and, ahem, no loose strings. The Jones Dream Weaver Splitboard is the ride for those who don't necessarily charge the biggest and steepest lines they can find, and want something a little less demanding than a Solution Split. With a flex rating of \"6\" and Traction Tech 3.0 edges for better hold on those sketchy traverses, this board will get you there and get down with you like a good friend.",
      "terrain": "Splitboarding",
      "abilityLevel": "Advanced-Expert",
      "rockerType": "Rocker/Camber/Rocker",
      "shape": "Directional",
      "flexRating": "Medium",
      "materials": "Metal, Wood",
      "warranty": "3 Years"
    }
  },
  {
    "productName": "GNU Antigravity C3 Snowboard",
    "price": "$479.99",
    "url": "https://www.evo.com/outlet/snowboards/gnu-antigravity-c3-snowboard-2023",
    "details": {
      "description": "As a snowboarder, gravity is your best friend and your arch nemesis. It pulls you down the hill, giving you the speed you need to soar, even as you do your best to escape its clutches. The GNU Antigravity C3 Snowboard is your new favorite pair of dancing shoes, helping you cha-cha just a little smoother in your dance with kinetic energy. It's an easy riding directional board that floats above the powder, soars off of natural features, and keeps you speeding by on your feet when the slippery slopes of the mountain are trying to drag you down for a hug.",
      "terrain": "All-Mountain",
      "abilityLevel": "Intermediate-Advanced",
      "rockerType": "Camber/Rocker/Camber",
      "shape": "Directional",
      "flexRating": "Medium",
      "materials": "Wood",
      "warranty": "1 Year"
    }
  },
  {
    "productName": "GNU Chromatic BTX Snowboard - Women's",
    "price": "$449.99",
    "url": "https://www.evo.com/outlet/snowboards/gnu-chromatic-btx-snowboard-womens",
    "details": {
      "description": "The GNU Chromatic BTX Snowboard is directional and progression-focused. Utilizing the awesome Original Banana rocker profile, this board is lively and reactive while remaining smooth-tempered and catch-free. It turns easily, pivots playfully, and provides a dependable platform on which you will easily master the art of the carve, and unlock the true colors of the mountain.",
      "terrain": "All-Mountain",
      "abilityLevel": "Beginner-Intermediate",
      "rockerType": "Camber/Rocker/Camber",
      "shape": "Directional",
      "flexRating": "Soft",
      "materials": "Wood",
      "warranty": "1 Year"
    }
  },
  {
    "productName": "GNU Riders Choice Asym C2X Snowboard",
    "price": "$659.99",
    "url": "https://www.evo.com/outlet/snowboards/gnu-riders-choice-asym-c2x-snowboard-2023",
    "details": {
      "description": "The GNU Riders Choice Asym C2X Snowboard breaks out all the stops, incorporating all of the highest end materials and signature tech that GNU is known for. It uses an asymmetrical design for easy, powerful turns, Magne-Traction edges for insane grip, a hybrid C2x Banana profile for tons of pop and pivot, and finishes this off with Carbon Power bands for a little extra oomph. And of course, the board is Mervin Made, so it's all done by hand in the great state of Washington using the most eco-friendly methods possible. The end result is a premier all-mountain freestyle deck that handles anything with explosive style and unlimited fun.",
      "terrain": "Freestyle, All-Mountain",
      "abilityLevel": "Intermediate-Advanced",
      "rockerType": "Camber/Rocker/Camber",
      "shape": "Asymmetrical, True Twin",
      "flexRating": "Medium",
      "materials": "Carbon, Wood",
      "warranty": "1 Year"
    }
  },
  {
    "productName": "Lib Tech Terrain Wrecker C2X Snowboard",
    "price": "$579.99",
    "url": "https://www.evo.com/outlet/snowboards/lib-tech-terrain-wrecker-c2x-snowboard-2023",
    "details": {
      "description": "Cue up the Miley Cyrus, because you're about to hit the mountain like a wrecking ball. The Lib Tech Terrain Wrecker C2X Snowboard is an all-mountain destroyer that's ready to hit the slopes. This directional twin is sturdy and stable charging down groomers and runouts, and lives to spin and tweak it's way through the air. It's a park board that it would be a shame to confine to just the park, with vibration dampening, speed-needing properties that are just waiting to be unleashed.",
      "terrain": "Freestyle, All-Mountain",
      "abilityLevel": "Advanced-Expert",
      "rockerType": "Camber/Rocker/Camber",
      "shape": "Directional Twin",
      "flexRating": "Stiff",
      "materials": "Wood",
      "warranty": "1 Year"
    }
  },
  {
    "productName": "K2 Raygun Snowboard 2023",
    "price": "$429.95",
    "url": "https://www.evo.com/snowboards/k2-raygun-snowboard",
    "details": {
      "description": "The K2 Raygun Snowboard is a point-and-shoot all-mountain snowboard for the people. This smooth-flexing directional twin comes with a flat profile for super easy turns and plenty of float. It's very accessible for beginner riders to learn on, but backed with high quality construction and a versatile shape that also makes it perfect for intermediate riders that like to mix it up on a variety of terrain. Wherever your voyage takes you, don't forget to bring your Raygun.",
      "terrain": "All-Mountain",
      "abilityLevel": "Beginner-Intermediate",
      "rockerType": "Rocker/Flat/Rocker",
      "shape": "Directional Twin",
      "flexRating": "Medium",
      "materials": "Carbon, Wood",
      "warranty": "3 Years"
    }
  },
  {
    "productName": "Burton Mini Grom Snowboard - Little Kids' 2024",
    "price": "$229.95",
    "url": "https://www.evo.com/snowboards/burton-mini-grom-snowboard-little-kids",
    "details": {
      "description": "Going, going, GROM! They grow up fast, so make sure you set your kid up for success by getting them on the Burton Mini Grom Snowboard. Sized for the tiniest nuggets on the hill, the Mini Grom is designed to instill a lifelong love of snowboarding. The Flat Top Easy Bevel design makes it hard to catch an edge, and the smooth contours and flex profile make the board fun and forgiving for little rippers to learn the ropes.",
      "terrain": "All-Mountain",
      "abilityLevel": "Beginner-Intermediate",
      "rockerType": "Flat",
      "shape": "True Twin",
      "flexRating": "Soft",
      "materials": "Wood",
      "warranty": "1 Year"
    }
  },
  {
    "productName": "K2 Party Platter Snowboard 2023",
    "price": "$499.95",
    "url": "https://www.evo.com/snowboards/k2-party-platter-snowboard",
    "details": {
      "description": "As one of the originators of the volume shifted movement, the K2 Party Platter Snowboard is serving up the goods. This fat directional board is meant to be ridden short, so you can turn it on a dime and start the party anytime. Simply put, it's a whole lot of fun. You get all the float and stability of a bigger board with all the easy riding, quick turning abilities of a shorter one. Rally through trees, spin threes of kickers, the Party Platter is down to clown, anytime, anyplace.",
      "terrain": "All-Mountain",
      "abilityLevel": "Intermediate-Advanced",
      "rockerType": "Rocker/Camber/Rocker",
      "shape": "Directional",
      "flexRating": "Medium",
      "materials": "Bamboo, Carbon, Wood",
      "warranty": "3 Years"
    }
  },
  {
    "productName": "Roxy Dawn Snowboard - Women's",
    "price": "$349.99",
    "url": "https://www.evo.com/outlet/snowboards/roxy-dawn-snowboard-womens",
    "details": {
      "description": "Looking for a new BFF? Preferably one who enjoys early morning carpool karaoke sessions on the way to go hang out in snow-capped mountains? The Roxy Dawn Snowboard is your ride or die, combining an easygoing personality with an insatiable thirst for adventure. This twin shape has an Easy-Rise rocker profile and a soft, forgiving flex that's ideal for beginner riders on the up.",
      "terrain": "All-Mountain",
      "abilityLevel": "Beginner-Intermediate",
      "rockerType": "Rocker/Flat/Rocker",
      "shape": "True Twin",
      "flexRating": "Soft",
      "materials": "Wood",
      "warranty": "1 Year"
    }
  }
]