[
  {
    "productName": "Rossignol Sender 94 Ti Skis 2023",
    "price": "$699.95",
    "url": "https://www.evo.com/skis/rossignol-sender-94-ti",
    "details": {
      "description": "The Rossignol Sender 94 Ti Skis offer a long coveted blend of titanal infused stability and a stiffer flex while still being nimble and easy to maneuver when things get spicy. Ideal for intermediate to advanced skiers who appreciate going fast and sending 'er deep off those natural sidehits and cat tracks, the Sender 94 Ti empowers you to charge all over the mountain whether conditions are prime or not!",
      "terrain": "All-Mountain",
      "abilityLevel": "Advanced-Expert",
      "rockerType": "Rocker/Camber/Rocker",
      "turningRadius": "Medium",
      "tailType": "Partial Twin Tip",
      "materials": "Metal, Wood",
      "warranty": "1 Year"
    }
  },
  {
    "productName": "Rossignol Rallybird 104 Ti Skis - Women's 2023",
    "price": "$849.95",
    "url": "https://www.evo.com/skis/rossignol-rallybird-104-ti-womens",
    "details": {
      "description": "Born from the demands of hard charging gals who need a ski that can keep on steep descents in variable conditions, the titanal injected Rossignol Rallybird 104 Ti Skis deliver! With a 104mm waist width, these skis straddle the line between powder-worthy float and the everyday edge control you need to carve confidently both off-piste and on groomers. If you're in the market for a strong, stable ski that won't leave you longing for more whether conditions are firm or soft, look to the ladies specific Rossignol Rallybird 104 Ti Skis.",
      "terrain": "Big Mountain, Powder",
      "abilityLevel": "Intermediate-Advanced",
      "rockerType": "Rocker/Camber/Rocker",
      "turningRadius": "Medium",
      "tailType": "Partial Twin Tip",
      "materials": "Wood",
      "warranty": "1 Year"
    }
  },
  {
    "productName": "Rossignol Black Ops 92 Skis ​+ Xpress 11 GW Bindings 2023",
    "price": "$649.95",
    "url": "https://www.evo.com/ski-packages/rossignol-black-ops-92-skis-xpress-11-gw-bindings",
    "details": {
      "description": "A new Black Ops shape ideal for sessioning every aspect of the hill, the Rossignol Black Ops 92 Skis + Xpress 11 GW Bindings are ideal for lighter riders who love to take air and who like a light and nimble feel underfoot. Built around a light Paulownia wood core (the same used for many touring skis) but with a freestyle shape, the 92 is ready to step it up when you are.",
      "terrain": "All-Mountain",
      "abilityLevel": "Intermediate-Advanced",
      "rockerType": "Rocker/Camber/Rocker",
      "turningRadius": "Short",
      "tailType": "Partial Twin Tip",
      "materials": "Wood",
      "warranty": "2 Years"
    }
  },
  {
    "productName": "Elan Ripstick 88 Skis - Women's 2023",
    "price": "$599.99",
    "url": "https://www.evo.com/skis/elan-ripstick-88-womens",
    "details": {
      "description": "Hey you. Yes, you reading this page. Do you like to go fast? Like, really fast? Get in on this, the Elan Ripstick 88 Skis MIGHT just help you beat your friends. Whether you like to smash the Ice Coast or get out on freshly groomed runs everywhere else, these sticks are all but guaranteed to help you beat your pals to the lift. Constructed with carbon rods that provide stability and power and a lightweight Tubelite Wood Core that makes the Ripstick easy to handle, they're a recipe for success. You've heard of the saying \"No friends on a pow day.\" But what about, \"No friends on a fast day?\" You know who you are. Get em' while they last!",
      "terrain": "All-Mountain",
      "abilityLevel": "Intermediate-Advanced",
      "rockerType": "Camber/Rocker/Camber",
      "turningRadius": "Short",
      "tailType": "Flat",
      "materials": "Carbon, Wood",
      "warranty": "2 Years"
    }
  },
  {
    "productName": "Elan Ripstick 96 Skis 2023",
    "price": "$699.99",
    "url": "https://www.evo.com/skis/elan-ripstick-96",
    "details": {
      "description": "Get your carve on with the Elan Ripstick 96 Skis, an every day ripper that excels on hard stuff and still delivers when it gets soft and creamy. From carving corduroy to hitting your fave stash, these bombers are made for heavy hitters who cut turns all the way across the run and don't mess around. Their asymmetrical amphibio profile gives you targeted precision exactly where you need it, while a Tubelite wood core with carbon keeps things light, agile, and ready to send side hits. Elan skis always deliver, and the Ripstick 96 is no exception.",
      "terrain": "All-Mountain",
      "abilityLevel": "Intermediate-Advanced",
      "rockerType": "Rocker/Camber/Rocker",
      "turningRadius": "Medium",
      "tailType": "Flat",
      "materials": "Carbon, Wood",
      "warranty": "2 Years"
    }
  },
  {
    "productName": "Armada Locator 96 Skis 2023",
    "price": "$749.95",
    "url": "https://www.evo.com/skis/armada-locator-96-2023",
    "details": {
      "description": "You know a company like Armada couldn't just make a standard issue touring ski without putting their own twist on it. The all-new Locator series brings Armada's special blend of freestyle heritage and creative style to the ultralight touring market, and the outcome is something special. The Armada Locator 96 Skis are the most traditional touring skis in the series, with a sub 100 waist width and a respectably airy 1350 gram weight. But those techy uphill numbers are paired with smooth lines and tapered tips to make for a ski you can count on for long, technical missions without sacrificing any fun on the descents.",
      "terrain": "Alpine Touring",
      "abilityLevel": "Advanced-Expert",
      "rockerType": "Rocker/Camber",
      "turningRadius": "Medium",
      "tailType": "Partial Twin Tip",
      "materials": "Carbon, Metal, Wood",
      "warranty": "2 Years"
    }
  },
  {
    "productName": "Rossignol Sender 104 Ti Skis 2023",
    "price": "$799.95",
    "url": "https://www.evo.com/skis/rossignol-sender-104-ti",
    "details": {
      "description": "The Rossignol Sender 104 Ti Skis pair a stiff flex with a maneuverable Free Rocker profile to create a stouter waisted all-mountain weapon that can hold it down on both hardpack as well as in the fresh fluff. Ideal for aggressive, hard charging skiers who want to go fast and send 'er deep off those natural sidehits and cat tracks, the Sender 104 Ti empowers you to charge all over the mountain without ever holding you back. From pow days to the post-storm chunder, ski confidently with the Rossignol Sender 104 Ti Skis.",
      "terrain": "All-Mountain, Big Mountain",
      "abilityLevel": "Advanced-Expert",
      "rockerType": "Rocker/Camber/Rocker",
      "turningRadius": "Medium",
      "tailType": "Partial Twin Tip",
      "materials": "Metal, Wood",
      "warranty": "1 Year"
    }
  },
  {
    "productName": "Fischer Ranger Skis 2023",
    "price": "$499.99",
    "url": "https://www.evo.com/skis/fischer-ranger",
    "details": {
      "description": "Fischer brings freeride flexibility and confidence to the groomers with the new Fischer Ranger Skis, with a do-it-all 92mm waist and freeski rocker to make managing any snow conditions a snap. With a full Poplar wood core and Sandwich Sidewall Construction, the Ranger holds its own on harder snow as well, so you'll be in good hands whatever winter may bring. Pick your length, your color, and let your imagination be your guide.",
      "terrain": "All-Mountain",
      "abilityLevel": "Intermediate-Advanced",
      "rockerType": "Rocker/Camber/Rocker",
      "turningRadius": "Short",
      "tailType": "Partial Twin Tip",
      "materials": "Wood",
      "warranty": "2 Years"
    }
  },
  {
    "productName": "Armada x Oyuki 106 UL Skis 2024",
    "price": "$849.00",
    "url": "https://www.evo.com/skis/armada-x-oyuki-arv-106-ul",
    "details": {
      "description": "The Armada x Oyuki 106 UL Skis celebrate Japanese art and the power of snow with a stunning limited edition topsheet from artist, Kentaro Yoshida. Engineered with an updated profile and Armada's signature Smear Tech tips and tails, these freestyle classics deliver effortless float and catch-free butters with surfy, playful style. An ultralight Caruba wood core keeps swing weight to a minimum and means the 106 UL can do double duty in the resort and backcountry alike. From the park to the pow, these might just be the last skis you ever need.",
      "terrain": "All-Mountain",
      "abilityLevel": "Intermediate-Advanced",
      "rockerType": "Rocker/Camber/Rocker",
      "turningRadius": "Medium",
      "tailType": "Partial Twin Tip",
      "materials": "Wood",
      "warranty": "2 Years"
    }
  },
  {
    "productName": "Armada Whitewalker 121 Skis 2023",
    "price": "$949.95",
    "url": "https://www.evo.com/skis/armada-whitewalker-121",
    "details": {
      "description": "Sammy C's Whitewalker Skis have quickly gone from experimental offering to freestyle staple, and now they have a big brother. The Armada Whitewalker 121 Skis feature the same pintail, twin tip design as the the originals, but with an even wider waist width for the deepest days. These skis are the ultimate playful powder tool. They're nimble, surfy, easy to spin, easy stomp, and ski just about as well backwards as they do forwards. And with a respectably lightweight build, they're an awesome choice to pair with a hybrid binding for a 50/50 powder ski.",
      "terrain": "Powder",
      "abilityLevel": "Advanced-Expert",
      "rockerType": "Rocker/Camber/Rocker",
      "turningRadius": "Medium",
      "tailType": "Full Twin Tip",
      "materials": "Wood",
      "warranty": "2 Years"
    }
  },
  {
    "productName": "Rossignol Black Ops 118 Tatum Skis 2023",
    "price": "$799.95",
    "url": "https://www.evo.com/skis/rossignol-black-ops-118-tatum",
    "details": {
      "description": "Finding the right combination of playful surfiness and straightline stability in a pow ski is as tough as fishing a Rainbow out of the creek with your bare hands, but Rossi nailed it with the Rossignol Black Ops 118 Tatum Skis. Tatum Monod's signature ride is a straight-up 176 men's ski (have you seen her vids?) featuring a one-of-a-kind graphic by David Habben. Get them now before they're gone.",
      "terrain": "Big Mountain, Powder",
      "abilityLevel": "Advanced-Expert",
      "rockerType": "Rocker/Camber/Rocker",
      "turningRadius": "Long",
      "tailType": "Partial Twin Tip",
      "materials": "Wood",
      "warranty": "1 Year"
    }
  },
  {
    "productName": "Nordica SUV 84 ​+ TP2 Compact FDT Ski Bindings 2023",
    "price": "$599.99",
    "url": "https://www.evo.com/ski-packages/nordica-suv-84-tp2-compact-fdt-bindings",
    "details": {
      "description": "Not your standard beginner setup by any means, the Nordica SUV 84 + TP2 Compact FDT Ski Bindings package is built exclusively for evo by one of the top factories in the business. With a solid all-mountain 84mm waist width to make those surprise overnight dumps a pleasure and with excellent hard snow handling and edge hold to boot, the SUV 84 is suitable for intermediate to advanced skiers. These come complete with Marker TP2 Compact FDT bindings for the most dependable boot-ski connection on the planet and ready to go anywhere on the mountain. Don't wait, these sold out in a hurry last season.",
      "terrain": "All-Mountain",
      "abilityLevel": "Intermediate-Advanced",
      "rockerType": "Rocker/Camber",
      "turningRadius": "Short",
      "tailType": "Flat",
      "materials": "Wood",
      "warranty": "1 Year"
    }
  },
  {
    "productName": "Head Absolut Joy SW SLR Pro Skis ​+ Joy 9 GW Bindings - Women's 2023",
    "price": "$649.00",
    "url": "https://www.evo.com/ski-packages/head-absolut-joy-sw-slr-pro-skis-9-gw-bindings",
    "details": {
      "description": "Elevate your time on groomers as well as the occasional off-piste adventure with the Head Absolut Joy SW SLR Pro Skis + Joy 9 GW Bindings package combo. A fun and approachable option for intermediate to advanced skiers, the Absolut Joy SW SLR Pro Skis feature a 79mm waist width with Allride rocker in the tips and camber underfoot for a wonderous blend of edgehold and easy turn initiation. Ideal for firmer snow conditions, this package is poised to boost your confidence on groomers from the get-go!",
      "terrain": "Carving, All-Mountain",
      "abilityLevel": "Intermediate-Advanced",
      "rockerType": "Rocker/Camber",
      "turningRadius": "Short",
      "tailType": "Flat",
      "materials": "Graphene, Polyurethane (PU), Wood",
      "warranty": "1 Year"
    }
  },
  {
    "productName": "Nordica Enforcer 94 Skis 2023",
    "price": "$749.99",
    "url": "https://www.evo.com/skis/nordica-enforcer-94-2023",
    "details": {
      "description": "The Enforcer line has become something of a cult classic by now. They're just so good, and with a wide range of widths available, there's one that's just right for every set of daily conditions. As the mid skinny option in the lineup, the Nordica Enforcer 94 Skis are an ideal daily driver for East Coast riders or those who tend to find themselves in firmer conditions. They're built around two sheets of titanal and a reinforced carbon chassis that makes them exceptionally precise, quick, and powerful snapping off turns edge to edge.",
      "terrain": "All-Mountain",
      "abilityLevel": "Advanced-Expert",
      "rockerType": "Rocker/Camber/Rocker",
      "turningRadius": "Medium",
      "tailType": "Partial Twin Tip",
      "materials": "Carbon, Metal, Wood",
      "warranty": "1 Year"
    }
  },
  {
    "productName": "Black Crows Anima Skis 2023",
    "price": "$999.95",
    "url": "https://www.evo.com/skis/black-crows-anima-2023",
    "details": {
      "description": "The Black Crows Anima Skis are wild things. Anyone seeking to tame them should simply look for a different ski. This is a ski that needs to be let loose, and laughs at attempts to simmer it down. But if you can prove yourself to be as fearsome, as bold, and as uncouth as the Anima, you'll never find a more reliable partner in crime. This big mountain ski is designed for Freeride World Tour descents, with the blend of soft snow handling, firm snow precision, balance in the air, and power through crud that you need to send huge lines and ride out the other side.",
      "terrain": "Big Mountain, Powder",
      "abilityLevel": "Advanced-Expert",
      "rockerType": "Rocker/Camber/Rocker",
      "turningRadius": "Medium",
      "tailType": "Partial Twin Tip",
      "materials": "Aramid (Kevlar®), Carbon, Wood",
      "warranty": "2 Years"
    }
  },
  {
    "productName": "Black Crows Vertis Birdie Skis - Women's 2023",
    "price": "$749.95",
    "url": "https://www.evo.com/skis/black-crows-vertis-birdie-womens-2023",
    "details": {
      "description": "The Black Crows Vertis Skis are smooth turning, short radius carving skis that turn every day into a vert staking festival. If you live for hot lapping groomers and feeling the flow of one turn blending into the next, the Vertis will help you unlock a deeper carver and a tighter arc than ever before. These are the perfect everyday resort ski for making the most of any piste, any time.",
      "terrain": "Carving, All-Mountain",
      "abilityLevel": "Intermediate-Advanced",
      "rockerType": "Rocker/Camber",
      "turningRadius": "Short",
      "tailType": "Flat",
      "materials": "Wood",
      "warranty": "2 Years"
    }
  },
  {
    "productName": "Black Crows Junius Birdie Skis - Kids' 2023",
    "price": "$259.95",
    "url": "https://www.evo.com/skis/black-crows-junius-birdie-kids-2023",
    "details": {
      "description": "The Black Crows Junius Birdie Skis are the perfect learning tools for new skiers. These little, lightweight skis feature a soft flex, plenty of catch-free rocker in the tip and tails, and a nice short turn radius for easy carving. They encourage having fun, trying new things, falling and getting back up, and trying and having fun all over again. Also available with a blue topsheet under the name Junius.",
      "terrain": "All-Mountain",
      "abilityLevel": "Beginner-Intermediate",
      "rockerType": "Rocker/Camber/Rocker",
      "turningRadius": "Short",
      "tailType": "Full Twin Tip",
      "materials": "Foam",
      "warranty": "2 Years"
    }
  },
  {
    "productName": "Fischer Ranger 116 Skis 2023",
    "price": "$949.99",
    "url": "https://www.evo.com/skis/fischer-ranger-116",
    "details": {
      "description": "Powder? More like power. The all new Fischer Ranger 116 Skis are top notch freeride sticks made for the steep and extra deep. Strong, clean, fresh, and with a straightforward design that caters to the hard-charging big mountain skier. The Ranger 116 is made with Fischer's directional Freeski Rocker and a lightweight and responsive woodcore with titanal metal underfoot, which gives you a maneuverable and manageable platform to send the tricks of your dreams. There are those who ski leisurely and then there are those who \"charge,\" the Fischer Ranger 116 is for the latter.",
      "terrain": "Big Mountain, Powder",
      "abilityLevel": "Advanced-Expert",
      "rockerType": "Rocker/Camber/Rocker",
      "turningRadius": "Medium",
      "tailType": "Partial Twin Tip",
      "materials": "Metal, Wood",
      "warranty": "2 Years"
    }
  },
  {
    "productName": "Season Pass Skis 2023",
    "price": "$799.00",
    "url": "https://www.evo.com/skis/season-pass",
    "details": {
      "description": "Introducing a backcountry ski for the most creative, pow-hungry earn-your-turners in the land, the Season Pass Skis are a wider, lighter take on the ultra-versatile Nexus skis, because the crew at Season know why you tour. Built with an ultra-light woodcore of Poplar and Paulownia and a nearly symmetrical twin shape, the Pass is light enough for full days on the trail but stout enough to shred hard on the way down. Never has there been such a wealth of options for skiing beyond the confines of the resort - the Season Pass pushes the envelope for the most playful and imaginative among us.",
      "terrain": "Big Mountain, Alpine Touring",
      "abilityLevel": "Intermediate-Advanced",
      "rockerType": "Rocker/Camber/Rocker",
      "turningRadius": "Short",
      "tailType": "Full Twin Tip",
      "materials": "Wood",
      "warranty": "Limited Lifetime"
    }
  },
  {
    "productName": "Völkl Secret 96 Skis - Women's 2023",
    "price": "$749.99",
    "url": "https://www.evo.com/skis/volkl-secret-96-womens-2023",
    "details": {
      "description": "We're not sure why they keep using this name, because the word's out. The Völkl Secret 96 Skis are the ripper skier's best friend, and the closest thing to a race ski that'll easily handle every snow condition on the mountain. The previous version of this ski was no slouch, but with the addition of the Tailored Titanal tip and Tailored Carbon Tips the Secret becomes calmer and more manageable without losing any of its inner strength or ability to track cleanly at speed. An amazing ski that responds best to a confident driver, the Secret 96 belongs in your quiver even if it's a quiver of one.",
      "terrain": "All-Mountain",
      "abilityLevel": "Advanced-Expert",
      "rockerType": "Rocker/Camber/Rocker",
      "turningRadius": "Short",
      "tailType": "Partial Twin Tip",
      "materials": "Carbon, Metal, Wood",
      "warranty": "1 Year"
    }
  },
  {
    "productName": "Völkl Revolt 86 Temple Skis 2023",
    "price": "$399.99",
    "url": "https://www.evo.com/skis/volkl-revolt-86-2",
    "details": {
      "description": "Session the park for a while, rip some groomers for a while, play in the trees a bit - all part of the game for the Völkl Revolt 86 Skis. A versatile all-mountain twin shape that also rips in the park, the Revolt 86 comes in two awesome graphic options and may be the best bang-for-the-buck choice for freestyle-oriented rippers on a budget.",
      "terrain": "Park & Pipe, All-Mountain",
      "abilityLevel": "Intermediate-Advanced",
      "rockerType": "Rocker/Camber/Rocker",
      "turningRadius": "Medium",
      "tailType": "Full Twin Tip",
      "materials": "Wood",
      "warranty": "1 Year"
    }
  },
  {
    "productName": "Völkl Mantra Junior Skis - Kids' 2023",
    "price": "$329.99",
    "url": "https://www.evo.com/skis/volkl-mantra-junior-kids",
    "details": {
      "description": "There comes a time in every parent's life when they look up the hill and go, \"There's a good skier . . . wait a minute, that's my kid!\" That's the moment you know they need real ski, and no company does it better than Völkl. The Völkl Mantra Junior Skis, as one might expect, emulate the power and precision of the adult Mantra skis, but without the Titanal frame or carbon webbing. They still offer rock solid Full Sidewall construction and the Power Construction layup, and deliver the kind of performance good kids deserve.",
      "terrain": "All-Mountain",
      "abilityLevel": "Intermediate-Advanced",
      "rockerType": "Rocker/Camber/Rocker",
      "turningRadius": "Short",
      "tailType": "Partial Twin Tip",
      "materials": "Wood",
      "warranty": "1 Year"
    }
  },
  {
    "productName": "Völkl Blaze 94 Skis 2023",
    "price": "$599.99",
    "url": "https://www.evo.com/skis/volkl-blaze-94-2023",
    "details": {
      "description": "Lightweight alpine ski that's quick and nimble enough for tight trees and technical terrain? Touring ski with enough guts to ski with confidence in tough terrain and variable snow? The Völkl Blaze 94 Skis are both. Amazingly stable and confident for their light weight, experienced backcountry skiers as well as inbounds riders who prefer their sticks on the light and maneuverable side are both finding the Blaze 94 hits a sweet spot they'd never known existed. A full sidewall construction with just a bit of Titanal underfoot and Völkl's proven 3D Radius add up to a package that's yearning to turn and capable anywhere on the mountain.",
      "terrain": "All-Mountain, Alpine Touring",
      "abilityLevel": "Intermediate-Advanced",
      "rockerType": "Rocker/Camber/Rocker",
      "turningRadius": "Short",
      "tailType": "Partial Twin Tip",
      "materials": "Metal, Wood",
      "warranty": "1 Year"
    }
  },
  {
    "productName": "Black Crows Camox Birdie Skis - Women's 2023",
    "price": "$799.95",
    "url": "https://www.evo.com/skis/black-crows-camox-birdie-womens-2023",
    "details": {
      "description": "The Black Crows Camox Birdie Skis embody the soul of all-mountain resort riding. These skis are meant to enable fun, stylish skiing all across any resort in any conditions. They do this with a versatile 97mm waist width, a smooth yet stable flex profile, and a perfectly honed directional rocker profile with camber underfoot and rocker on either end. It's a ski that's playful, poppy, poised, and very easy to get along with.",
      "terrain": "All-Mountain",
      "abilityLevel": "Intermediate-Advanced",
      "rockerType": "Rocker/Camber/Rocker",
      "turningRadius": "Medium",
      "tailType": "Partial Twin Tip",
      "materials": "Wood",
      "warranty": "2 Years"
    }
  },
  {
    "productName": "Nordica Enforcer 88 Skis 2023",
    "price": "$699.99",
    "url": "https://www.evo.com/skis/nordica-enforcer-88-2023",
    "details": {
      "description": "Looking for a frontside ski that rails like Lewis Hamilton at Monza but doesn't make you feel like a quitter when it's late in the day and your legs are noodles? Check out the Nordica Enforcer 88 Skis, a ride with a race pedigree built by people who know you're still human and maybe don't want to work that hard all day long.",
      "terrain": "All-Mountain",
      "abilityLevel": "Intermediate-Advanced",
      "rockerType": "Rocker/Camber/Rocker",
      "turningRadius": "Medium",
      "tailType": "Partial Twin Tip",
      "materials": "Metal, Wood",
      "warranty": "1 Year"
    }
  },
  {
    "productName": "Nordica Enforcer 104 Free Skis 2023",
    "price": "$799.99",
    "url": "https://www.evo.com/skis/nordica-enforcer-104-free-2023",
    "details": {
      "description": "The Nordica Enforcer 104 Free Skis are built for the uninhibited. For the rider who sees corduroy as a straight-jacket, and who finds the flowing pathways through moguls and trees to be a bit more friendly on the mind. These freeride sticks bring you all of the power and versatility of the fabled Enforcer line, but with a touch more rocker and a touch less metal, which helps them bend past the rules prescribed by traditional ski shaping, and find surfy lines through powder and off piste terrain. If you love the Enforcer 100s but wish they were a little more progressive and playful, this is your ski.",
      "terrain": "All-Mountain, Big Mountain",
      "abilityLevel": "Advanced-Expert",
      "rockerType": "Rocker/Camber/Rocker",
      "turningRadius": "Medium",
      "tailType": "Partial Twin Tip",
      "materials": "Carbon, Metal, Wood",
      "warranty": "1 Year"
    }
  },
  {
    "productName": "Black Crows Camox Freebird Skis 2023",
    "price": "$799.95",
    "url": "https://www.evo.com/skis/black-crows-camox-freebird",
    "details": {
      "description": "The Black Crows Camox Freebird Skis make the backcountry more accessible than ever before. These super light touring skis offer easier handling that almost any touring ski on the market, with a smooth directional design and moderate flex. The 95mm waist width is versatile and nimble through the varied conditions you're likely to find beyond the reach of groomers and ski patrollers, making this an awesome choice for experienced riders to expand their repertoire. They pair well with sturdy touring bindings, a well-rounded avalanche education, and a knowledgeable ski partner.",
      "terrain": "Alpine Touring",
      "abilityLevel": "Intermediate-Advanced",
      "rockerType": "Rocker/Camber/Rocker",
      "turningRadius": "Medium",
      "tailType": "Partial Twin Tip",
      "materials": "Carbon, Metal, Wood",
      "warranty": "2 Years"
    }
  },
  {
    "productName": "Black Crows Navis Freebird Skis 2023",
    "price": "$899.95",
    "url": "https://www.evo.com/skis/black-crows-navis-freebird",
    "details": {
      "description": "The Black Crows Navis Freebird Skis are all-around excellent tools for any human powered mission. Built for versatility, this 102-waisted ski is exactly what most riders are looking for in an all season touring ski. It's built with a directional freeride shape, plenty of camber underfoot, and just enough rocker in the tip to plane over mixed snow surfaces. Pair that do-everything design with a featherweight layup that's designed for hybrid binding compatibility, and it's easy to see why so many skiers look to the Navis anytime they hit the skin track.",
      "terrain": "Alpine Touring",
      "abilityLevel": "Intermediate-Advanced",
      "rockerType": "Rocker/Camber",
      "turningRadius": "Medium",
      "tailType": "Flat",
      "materials": "Carbon, Metal, Wood",
      "warranty": "2 Years"
    }
  },
  {
    "productName": "Black Crows Junius Skis - Kids' 2023",
    "price": "$259.95",
    "url": "https://www.evo.com/skis/black-crows-junius-kids-2023",
    "details": {
      "description": "The Black Crows Junius Skis are the perfect learning tools for new skiers. These little, lightweight skis feature a soft flex, plenty of catch-free rocker in the tip and tails, and a nice short turn radius for easy carving. They encourage having fun, trying new things, falling and getting back up, and trying and having fun all over again. Also available with a pink topsheet under the name Junius Birdie.",
      "terrain": "All-Mountain",
      "abilityLevel": "Beginner-Intermediate",
      "rockerType": "Rocker/Camber/Rocker",
      "turningRadius": "Short",
      "tailType": "Full Twin Tip",
      "materials": "Foam",
      "warranty": "2 Years"
    }
  },
  {
    "productName": "Black Crows Atris Birdie Skis - Women's 2023",
    "price": "$899.95",
    "url": "https://www.evo.com/skis/black-crows-atris-birdie-womens-2023",
    "details": {
      "description": "The Atris Birdie is one of the most popular birds in the Black Crows' flock. This traditionally cambered freeride ski has one of the most balanced skill sets around. It is the quintessential playful charger, providing excellent high end performance in freeride-style lines, while also remaining smooth and accessible for all-mountain endeavors. With a 105 width that's floaty enough for powder days and maneuverable enough for groomers, the Black Crows Atris Birdie Skis are an excellent choice for competent all-mountain skiers looking to tackle any day of the season.",
      "terrain": "All-Mountain, Big Mountain",
      "abilityLevel": "Intermediate-Advanced",
      "rockerType": "Rocker/Camber/Rocker",
      "turningRadius": "Medium",
      "tailType": "Partial Twin Tip",
      "materials": "Wood",
      "warranty": "2 Years"
    }
  },
  {
    "productName": "K2 Midnight Skis 2023 - Women's",
    "price": "$449.95",
    "url": "https://www.evo.com/skis/k2-midnight",
    "details": {
      "description": "Swift and stealthy, the K2 Midnight Skis come alive in the park like a thief in the night. All-Terrain Rocker adds control to the setup so it can coast you through variable conditions while the aspen wood core keeps things light and sturdy. Practice makes perfect, and thanks to the durable sidewall construction, you can lap the park till you absolutely stomp the landing. We think you're raily, raily gonna like this one.",
      "terrain": "Park & Pipe, All-Mountain",
      "abilityLevel": "Advanced-Expert",
      "rockerType": "Rocker/Camber/Rocker",
      "turningRadius": "Short",
      "tailType": "Full Twin Tip",
      "materials": "Carbon, Wood",
      "warranty": "2 Years"
    }
  },
  {
    "productName": "Line Skis Pandora 110 Skis - Women's 2023",
    "price": "$799.95",
    "url": "https://www.evo.com/skis/line-pandora-110-womens-2023",
    "details": {
      "description": "From big mountain descents to powdery tours, the Line Skis Pandora 110 Skis are designed to be with you on the best days of the season. These full on freeride sticks are built with Line's ultra lightweight THC construction, which makes them a breeze to bring up the skin track, and a hurricane to bring down the fall line. They're fast and directional when charging through chop, yet light and effortless to flick, bounce, and pivot through deep power and tight terrain.",
      "terrain": "All-Mountain, Big Mountain, Powder, Alpine Touring",
      "abilityLevel": "Intermediate-Advanced",
      "rockerType": "Rocker/Camber/Rocker",
      "turningRadius": "Medium",
      "tailType": "Partial Twin Tip",
      "materials": "Aramid (Kevlar®), Carbon, Wood",
      "warranty": "2 Years"
    }
  },
  {
    "productName": "Line Skis Vision 98 Skis 2023",
    "price": "$749.95",
    "url": "https://www.evo.com/skis/line-vision-98",
    "details": {
      "description": "The Line Skis Vision 98 Skis can handle it. \"Handle what?\" you're asking yourself. Doesn't matter. The Vision 98 Skis have got it. Looking for an everyday resort ski? The Vision 98 is fast, predicable, incredibly versatile. Looking to get crazy on some park jumps? The Vision 98 is balanced, playful, nearly symmetrical. Looking for a fast and light touring ski? The Vision 98 weighs just over 1500 grams. That's crazy light. Wherever you need nimble, lightweight, performance and standout adaptability, the Line Skis Vision 98 Skis have got you covered.",
      "terrain": "All-Mountain, Alpine Touring",
      "abilityLevel": "Intermediate-Advanced",
      "rockerType": "Rocker/Camber/Rocker",
      "turningRadius": "Medium",
      "tailType": "Partial Twin Tip",
      "materials": "Aramid (Kevlar®), Carbon, Wood",
      "warranty": "2 Years"
    }
  },
  {
    "productName": "K2 Reckoner 102 Skis 2023",
    "price": "$649.95",
    "url": "https://www.evo.com/skis/k2-reckoner-102-2023",
    "details": {
      "description": "A full twin tip that's ready to whip pow to park, sunrise till sunset? Yes please. The K2 Reckoner 102 Skis thrive in just about every environment. Whether you're finding good air in side hit city, carving on edge through the ice coast, or dropping cork threes with your eyes closed, this all-terrain twin rocker ripper gives you all the versatility you could hope for, with enough pop and play to keep things interesting.",
      "terrain": "All-Mountain",
      "abilityLevel": "Intermediate-Advanced",
      "rockerType": "Rocker/Camber/Rocker",
      "turningRadius": "Medium",
      "tailType": "Full Twin Tip",
      "materials": "Carbon, Wood",
      "warranty": "2 Years"
    }
  },
  {
    "productName": "Line Skis Blend Skis 2023",
    "price": "$649.95",
    "url": "https://www.evo.com/skis/line-blend-2023",
    "details": {
      "description": "Built as an all around platform for park skiing and playful riding, the Line Skis Blend Skis will help you expand your trick game whether you're a seasoned vet or an up-and-comer. The flex is smooth and pliable, but with plenty of snap and rebound. They're a freestyle staple for a reason, and you're sure to find your own favorite way to pop, press, spin, and slide the Blends through your local park.",
      "terrain": "Park & Pipe, All-Mountain",
      "abilityLevel": "Intermediate-Advanced",
      "rockerType": "Rocker/Camber/Rocker",
      "turningRadius": "Medium",
      "tailType": "Full Twin Tip",
      "materials": "Carbon, Wood",
      "warranty": "2 Years"
    }
  },
  {
    "productName": "K2 Mindbender Team Jr Skis - Kids' 2023",
    "price": "$399.95",
    "url": "https://www.evo.com/skis/k2-mindbender-team-jr-kids",
    "details": {
      "description": "For the junior senders who like to roll with the big dogs, the K2 Mindbender Team Jr Skis are your ticket to shred town. With a responsive Aspen Veneer core and versatile All-Terrain Rocker, they are made to last through rugged freeride terrain. Coming in at 98mm underfoot, these skis are geared up to be the do-it-all, smack the lip, carve through crud kind of ski that fosters progression from opening day till the end of the season. Time to bust it down and tear it up.",
      "terrain": "Big Mountain, Powder",
      "abilityLevel": "Intermediate-Advanced",
      "rockerType": "Rocker/Camber/Rocker",
      "turningRadius": "Short",
      "tailType": "Flat",
      "materials": "Wood",
      "warranty": "2 Years"
    }
  },
  {
    "productName": "Line Skis Sir Francis Bacon Skis 2023",
    "price": "$749.95",
    "url": "https://www.evo.com/skis/line-sir-francis-bacon",
    "details": {
      "description": "By now, this ski needs no introduction. The Line Skis Sir Francis Bacon Skis have inspired generations of fun-loving all-mountain freestyle skis, and generations of fun-loving all-mountain skiers. They feature a silky smooth flex pattern that's just stiff enough to hold up to explosive resort skiing and just soft enough to absolutely butter the popcorn out of. They have convex tips and tails that beg to be smeared around, and a spring-loaded core that turns every roller into a trampoline waiting to happen. This is the ski that Line made their name on, and it continues to be one of the most fun all-mountain rides in the business.",
      "terrain": "All-Mountain",
      "abilityLevel": "Intermediate-Advanced",
      "rockerType": "Rocker/Camber/Rocker",
      "turningRadius": "Short",
      "tailType": "Full Twin Tip",
      "materials": "Wood",
      "warranty": "2 Years"
    }
  },
  {
    "productName": "Armada Declivity 102 Ti Skis 2023",
    "price": "$799.95",
    "url": "https://www.evo.com/skis/armada-declivity-102-ti-2023",
    "details": {
      "description": "The Armada Declivity 102 Ti Skis are perfect for a hard charging East Coast skier, or anyone who like to go fast and tends more toward the frontside end of the spectrum. With plenty of metal in the build, a directional shape, and a lightweight Caruba core, these skis are lively, damp, and powerful without being overly demanding. They're high speed fun for any day you want it.",
      "terrain": "All-Mountain",
      "abilityLevel": "Advanced-Expert",
      "rockerType": "Rocker/Camber",
      "turningRadius": "Medium",
      "tailType": "Flat",
      "materials": "Metal, Wood",
      "warranty": "2 Years"
    }
  },
  {
    "productName": "Atomic Bent Chetler Mini Skis - Kids' 2023",
    "price": "$299.95 - $349.95",
    "url": "https://www.evo.com/skis/atomic-bent-chetler-mini-little-kids",
    "details": {
      "description": "When they start asking to follow you out the backcountry gate, you know it's time to look into the best kid's freeride tool available: the Atomic Bent Chetler Mini Skis. The 90mm waist and Powder Rocker profile provide plenty of surface area to float growing bodies, while lightweight Dura Cap construction keeps the weight down and the maneuverability high. Dial up a few Kai Jones videos and get your kid ready for the time of their life.",
      "terrain": "All-Mountain",
      "abilityLevel": "Beginner-Intermediate",
      "rockerType": "Rocker/Camber/Rocker",
      "turningRadius": "Short",
      "tailType": "Partial Twin Tip",
      "materials": "Composite",
      "warranty": "2 Years"
    }
  },
  {
    "productName": "Armada ARW 96 Skis - Women's 2023",
    "price": "$549.95",
    "url": "https://www.evo.com/skis/armada-arw-96-womens",
    "details": {
      "description": "Skiing is fun. It's a fact. Flying down the mountain, biting your edges into the snow, snaking between the trees, feeling the wind hit your face and the gravity hit your toes. There's nothing like it and that is an objective truth. The Armada ARW 96 Skis are built as an homage to this unarguable fact. They're not specialized tools for mountaineering first descents or maximum hardcoreness, but if you're trying to go to the resort and have one heck of a time, there's nothing better. These all mountain freestyle skis are at home in the park, on the steeps, or on the groomers. They're poppy, dependable, and just plain fun.",
      "terrain": "Park & Pipe, All-Mountain",
      "abilityLevel": "Intermediate-Advanced",
      "rockerType": "Rocker/Camber/Rocker",
      "turningRadius": "Medium",
      "tailType": "Full Twin Tip",
      "materials": "Wood",
      "warranty": "2 Years"
    }
  },
  {
    "productName": "Nordica Santa Ana 98 Skis - Women's 2023",
    "price": "$749.99",
    "url": "https://www.evo.com/skis/nordica-santa-ana-98-womens-2023",
    "details": {
      "description": "The Nordica Santa Ana 98 Skis might just be the most versatile women's skis ever made. It's hard to make something so universally beloved by pros and everyday skiers alike, but Nordica has done it. The middle child of the Santa Ana family is a blend of lightweight and powerful, with tons of grip and drive for confidence down the fall line, but a surprisingly quick and intuitive feel when carving turns at slower speeds. It rewards good technique without punishing the occasional lapse in form, and performs well in the full spectrum of snow conditions, making it an ideal one-ski quiver for skiers that want to ride it all.",
      "terrain": "All-Mountain",
      "abilityLevel": "Advanced-Expert",
      "rockerType": "Rocker/Camber/Rocker",
      "turningRadius": "Short",
      "tailType": "Partial Twin Tip",
      "materials": "Carbon, Metal, Wood",
      "warranty": "1 Year"
    }
  },
  {
    "productName": "Black Crows Atris Jr Skis - Kids' 2023",
    "price": "$629.95",
    "url": "https://www.evo.com/skis/black-crows-atris-jr-kids",
    "details": {
      "description": "The Black Crows Atris Jr Skis are built for kids on their way to big things. These excellent all-mountain skis have the chops to hang with kids talking the toughest lines at the resort, as well as a smooth turning soul that encourages progression and creativity. This combination makes them a perfect learning ski that they won't grow out of once their skills are starting to take off. It's smooth, stable, and consistent on any kind of terrain from the groomers to the steep and deep.",
      "terrain": "All-Mountain, Big Mountain",
      "abilityLevel": "Intermediate-Advanced",
      "rockerType": "Rocker/Camber/Rocker",
      "turningRadius": "Medium",
      "tailType": "Partial Twin Tip",
      "materials": "Wood",
      "warranty": "2 Years"
    }
  },
  {
    "productName": "K2 Disruption 76 Skis ​+ M2 10 Bindings 2023",
    "price": "$449.95",
    "url": "https://www.evo.com/ski-packages/k2-disruption-76-skis-m2-10-bindings-2023",
    "details": {
      "description": "The K2 Disruption 76 Skis + M2 10 Bindings are entry-level groomer skis with above average construction and attention to detail. Borrowing the same shaping philosophy as the rest of the Disruption family, these skis swap out for flexible materials and a catch free rocker profile. They're straightforward to pilot, smooth on edge, and make carving across groomers easier than ever.",
      "terrain": "Carving",
      "abilityLevel": "Beginner-Intermediate",
      "rockerType": "Rocker/Camber/Rocker",
      "turningRadius": "Short",
      "tailType": "Flat",
      "materials": "Composite",
      "warranty": "2 Years"
    }
  },
  {
    "productName": "K2 Disruption 75 Skis ​+ ERP 10 Bindings - Women's 2023",
    "price": "$449.95",
    "url": "https://www.evo.com/ski-packages/k2-disruption-75-skis-m2-10-bindings-womens",
    "details": {
      "description": "The K2 Disruption 75 Skis + ERP 10 Bindings are entry-level groomer skis with above average construction and attention to detail. Borrowing the same shaping philosophy as the rest of the Disruption family, these skis swap out for flexible materials and a catch free rocker profile. They're straightforward to pilot, smooth on edge, and make carving across groomers easier than ever.",
      "terrain": "Carving",
      "abilityLevel": "Beginner-Intermediate",
      "rockerType": "Rocker/Camber/Rocker",
      "turningRadius": "Short",
      "tailType": "Flat",
      "materials": "Composite",
      "warranty": "2 Years"
    }
  },
  {
    "productName": "K2 Mindbender 85 Skis 2023",
    "price": "$399.95",
    "url": "https://www.evo.com/skis/k2-mindbender-85-2023",
    "details": {
      "description": "If rentals just aren't cutting it anymore and you're feeling confident that it's time for an upgrade, the K2 Mindbender 85 Skis are your next step towards continual improvement. This lightweight, forgiving and intuitive setup helps you inch out of your confront zone to tackle new parts of the mountain and have loads of fun doing so. The agility of these skis will help spark confidence in your skills while you take to more challenging terrain, getting you pumped for what's to come.",
      "terrain": "All-Mountain",
      "abilityLevel": "Beginner-Intermediate",
      "rockerType": "Rocker/Camber/Rocker",
      "turningRadius": "Short",
      "tailType": "Partial Twin Tip",
      "materials": "Wood",
      "warranty": "2 Years"
    }
  },
  {
    "productName": "K2 Reckoner 112 Skis 2023",
    "price": "$749.95",
    "url": "https://www.evo.com/skis/k2-reckoner-112-2023",
    "details": {
      "description": "Bounce from treetop pillows? Check. Slash two feet of fresh powder? Check. Cut through crud like butter? Check. The list goes on for the K2 Reckoner 112 Skis. These all purpose, free-style friendly rippers take you from hucking natural features on the frontside to steep and deep descents on the back withough missing a beat. With impact resistance tech in the core and woven carbon stringers throughout, these skis have an energetic rebound so you can stay out all day giving it heck.",
      "terrain": "All-Mountain, Big Mountain",
      "abilityLevel": "Advanced-Expert",
      "rockerType": "Rocker/Camber/Rocker",
      "turningRadius": "Long",
      "tailType": "Full Twin Tip",
      "materials": "Carbon, Wood",
      "warranty": "2 Years"
    }
  },
  {
    "productName": "K2 Poacher Skis 2023",
    "price": "$549.95",
    "url": "https://www.evo.com/skis/k2-poacher-2023",
    "details": {
      "description": "This old friend of freestyle is back and better than ever. For rail assassins that make the city their playground all the way to the tip-top of the podium, the K2 Poacher Skis undoubtedly bring the heat. Their burly build and woven carbon stringers from tip to tail bring out the super stable yet energetic personality that makes them a strong contender in competition. Time to send 'er deep, bud!",
      "terrain": "Park & Pipe, All-Mountain",
      "abilityLevel": "Intermediate-Advanced",
      "rockerType": "Rocker/Camber/Rocker",
      "turningRadius": "Medium",
      "tailType": "Full Twin Tip",
      "materials": "Carbon, Wood",
      "warranty": "2 Years"
    }
  },
  {
    "productName": "Line Skis Honey Badger Skis 2023",
    "price": "$399.95",
    "url": "https://www.evo.com/skis/line-honey-badger-2023",
    "details": {
      "description": "Okay, okay, we all know that the honey badger don't care. And if you don't know by now that the Line Skis Honey Badger Skis are one of the best freestyle skis around, then we don't know where you've been sleeping. If you're looking to progress your park game, chances are someone has recommended this ski to you. And they were right! It offers some of the best bang for buck around, with high level performance on rails, jumps, and boxes, plus out-of-this-world durability. These Honey Badgers are crazy!",
      "terrain": "Park & Pipe",
      "abilityLevel": "Intermediate-Advanced",
      "rockerType": "Rocker/Camber/Rocker",
      "turningRadius": "Medium",
      "tailType": "Full Twin Tip",
      "materials": "Carbon, Wood",
      "warranty": "2 Years"
    }
  },
  {
    "productName": "Line Skis Pandora 84 Skis - Women's 2023",
    "price": "$449.95",
    "url": "https://www.evo.com/skis/line-pandora-84-womens-2023",
    "details": {
      "description": "The Line Skis Pandora 84 Skis are a sunny day ski done in a special way. The narrow waist, light swing weight, and tight turn radius make these things an absolute joy to lay across groomers. They're incredibly smooth on edge, easy to bend into a variety of turn shapes, and they provide tons of rebound and energy coming out of each turn. If your ski days consist mostly of zooming around groomers and playing through the occasional mogul field or tree line, the Pandora 84 is the ski for you.",
      "terrain": "All-Mountain",
      "abilityLevel": "Intermediate-Advanced",
      "rockerType": "Rocker/Camber/Rocker",
      "turningRadius": "Short",
      "tailType": "Partial Twin Tip",
      "materials": "Carbon, Wood",
      "warranty": "2 Years"
    }
  },
  {
    "productName": "Line Skis Wallisch Shorty Skis ​+ FTD 4.5 Bindings - Kids' 2023",
    "price": "$339.95",
    "url": "https://www.evo.com/ski-packages/line-skis-wallisch-shorty-ftd-45-bindings-little-boys",
    "details": {
      "description": "The Line Skis Wallisch Shorty Skis + FTD 4.5 Bindings were made for all the ripping kids who spend every weekend in the terrain park. These junior sized park sticks are built to be competition ready, helping the next generation of freestyle skiers progress the sport to places none of the old folks could ever dream of. Modeled after the full-sized TW pro model, these skis are poppy, balanced, and bomber for all of their freestyle needs.",
      "terrain": "Park & Pipe",
      "abilityLevel": "Intermediate-Advanced",
      "rockerType": "Rocker/Camber/Rocker",
      "turningRadius": "Short",
      "tailType": "Full Twin Tip",
      "materials": "Wood",
      "warranty": "2 Years"
    }
  },
  {
    "productName": "K2 Mindbender 90 C Skis 2023",
    "price": "$499.95",
    "url": "https://www.evo.com/skis/k2-mindbender-90c",
    "details": {
      "description": "Harnessing some high energy, the K2 Mindbender 90C Skis are ready to carve up the resort with a light and playful feel. These skis utilize K2's Carbon Spectral Braid technology, allowing them to bend and snap through terrain without having to incorporate the added weight of a Titanal laminate. If you're searching for a fun, energetic ride on the hill, these planks are where its at.",
      "terrain": "All-Mountain",
      "abilityLevel": "Intermediate-Advanced",
      "rockerType": "Rocker/Camber/Rocker",
      "turningRadius": "Medium",
      "tailType": "Flat",
      "materials": "Carbon, Wood",
      "warranty": "2 Years"
    }
  },
  {
    "productName": "K2 Mindbender 106 C Skis - Women's 2023",
    "price": "$649.95",
    "url": "https://www.evo.com/skis/k2-mindbender-106-c-womens",
    "details": {
      "description": "Lady chargers, this one is for you. The K2 Mindbender 106 C Skis are the dynamic, do-it-all, women’s-specific design that rips in every set of conditions the mountain can throw at you. The Spectral Braid technology utilizes carbon reinforcement to prioritize stability and control at faster speeds while remaining easy to maneuver no matter where you are on the slopes. The mid-fat waist and lightweight core are the perfect combo for tearing up groomers or kicking it into high gear to take a dive in the deep end. Wherever your mountain motivation takes you, the K2 Mindbender 106 C Skis are ready for take-off.",
      "terrain": "All-Mountain, Powder",
      "abilityLevel": "Intermediate-Advanced",
      "rockerType": "Rocker/Camber/Rocker",
      "turningRadius": "Short",
      "tailType": "Flat",
      "materials": "Carbon, Metal, Wood",
      "warranty": "2 Years"
    }
  },
  {
    "productName": "Head Oblivion 79 Skis 2023",
    "price": "$349.00",
    "url": "https://www.evo.com/skis/head-oblivion-79",
    "details": {
      "description": "The new Head Oblivion 79 Skis are designed for the skier who is just as likely to spend the day in the park as anywhere else on the mountain, but doesn't want to be limited to a strictly-park symmetrical twin design. Wood Core twin tip construction with PNP rocker means you can handle it all, all of the time, forward or switch, with no worries.",
      "terrain": "Park & Pipe, All-Mountain",
      "abilityLevel": "Intermediate-Advanced",
      "rockerType": "Rocker/Camber/Rocker",
      "turningRadius": "Medium",
      "tailType": "Partial Twin Tip",
      "materials": "Wood",
      "warranty": "1 Year"
    }
  },
  {
    "productName": "Völkl M6 Mantra Skis 2023",
    "price": "$749.99",
    "url": "https://www.evo.com/skis/volkl-m6-mantra-2023",
    "details": {
      "description": "The Völkl M6 Mantra Skis have ruled the expert all-mountain roost for years, and they show no signs of giving up their perch soon. The addition of Tailored Carbon Tips and Tailored Titanal Frame elements made the M5, already a great ski, even more predictable and capable, and the M6 marches on with no changes other than graphics. If you're looking for the ultimate in luxurious power with edgehold for miles, the M6 is hard to beat.",
      "terrain": "All-Mountain",
      "abilityLevel": "Advanced-Expert",
      "rockerType": "Rocker/Camber/Rocker",
      "turningRadius": "Medium",
      "tailType": "Partial Twin Tip",
      "materials": "Carbon, Metal, Wood",
      "warranty": "1 Year"
    }
  },
  {
    "productName": "Völkl Blaze 86 Skis ​+ vMotion 11 GW Bindings 2023",
    "price": "$649.99",
    "url": "https://www.evo.com/ski-packages/volkl-blaze-86-skis-vmotion-11-gw-bindings",
    "details": {
      "description": "The Völkl Blaze 86 Skis + Vmotion 11 GW Bindings come in hot with an unbeatable combination of light weight and confident performance. Touring ski weight without taking the hit of sloppy and weak downhill performance is the name of the game, and Völkl nails it in the Blaze series. The combination of 3D Radius sidecut, traditional full sidewall construction, and reasonably stiff torsional flex gets it done and makes this a perfect \"light\" alpine ski choice or quiver of one for those who tour part time.",
      "terrain": "All-Mountain",
      "abilityLevel": "Intermediate-Advanced",
      "rockerType": "Rocker/Camber/Rocker",
      "turningRadius": "Short",
      "tailType": "Partial Twin Tip",
      "materials": "Wood",
      "warranty": "1 Year"
    }
  },
  {
    "productName": "Völkl Blaze 86 W Skis ​+ vMotion 10 GW Bindings - Women's 2023",
    "price": "$649.99",
    "url": "https://www.evo.com/ski-packages/volkl-blaze-86-w-skis-vmotion-10-gw-bindings-womens",
    "details": {
      "description": "Light as a feather but ready for any challenge, the Völkl Blaze 86 W Skis + Vmotion 10 GW Bindings are a great choice for quick bump runs, slashing through the trees, and heading out of bounds through tight terrain. A Multilayer Woodcore Light construction with 3D Radius Sidecut and full sidewalls contribute to make this one of the most versatile and dependable light skis out there; add the dependable Marker vMotion 10 GW binding and call it good.",
      "terrain": "All-Mountain",
      "abilityLevel": "Intermediate-Advanced",
      "rockerType": "Rocker/Camber/Rocker",
      "turningRadius": "Short",
      "tailType": "Partial Twin Tip",
      "materials": "Wood",
      "warranty": "1 Year"
    }
  },
  {
    "productName": "Völkl Revolt 121 Skis 2023",
    "price": "$699.99",
    "url": "https://www.evo.com/skis/volkl-revolt-121-2023",
    "details": {
      "description": "By now you're no doubt seen Markus Eder's Ultimate video and marvelled at his ability to stomp monster lines and line up those huge crevasse-spanning airs. Sure, Markus has next-level skills most of us can only dream of, but a big part of the puzzle is his equipment, and as pretty much everyone is aware, his skis for both filming and FWT events are the Völkl Revolt 121 Skis. When you aim big, and neither you nor your skis can afford a moment of hesitation or weakness, the Revolt 121 will always step up. Tons of float, no real speed limit to hinder you, and a sick new graphic add up to a quiver essential.",
      "terrain": "Big Mountain, Powder",
      "abilityLevel": "Advanced-Expert",
      "rockerType": "Rocker/Camber/Rocker",
      "turningRadius": "Medium",
      "tailType": "Full Twin Tip",
      "materials": "Wood",
      "warranty": "1 Year"
    }
  },
  {
    "productName": "Head Shape V2 Skis ​+ PR 11 GW Bindings 2023",
    "price": "$499.00",
    "url": "https://www.evo.com/ski-packages/head-shape-v2-skis-pr-11-gw-bindings",
    "details": {
      "description": "An easy introduction to the world of carving, the Head Shape V2 Skis + PR 11 GW Bindings let you get the feel of making quality turns without the hooky feel of more advanced ski designs. They're perfect for those looking to perfect their frontside technique, and their light and lively personality makes every run a blast.",
      "terrain": "All-Mountain",
      "abilityLevel": "Beginner-Intermediate",
      "rockerType": "Rocker/Camber",
      "turningRadius": "Short",
      "tailType": "Flat",
      "materials": "Composite",
      "warranty": "1 Year"
    }
  },
  {
    "productName": "Völkl Blaze 106 Skis 2023",
    "price": "$649.99",
    "url": "https://www.evo.com/skis/volkl-blaze-106-2023",
    "details": {
      "description": "Tired of researching light mid-fats that can double as touring skis? Put down the Google and jump on the Völkl Blaze 106 Skis, you won't regret it for a minute. Light enough for long days in the saddle (1593 grams at 165cm) but not so light as to compromise edgehold and security when it gets sketchy, the Blaze 106 exemplifies Völkl's obsessive attitude toward quality and performance. Built around a Hybrid Multilayer Woodcore with full sidewall construction and Suspension Tips and Tails for smooth riding in all conditions, the Blaze 106 brings the heat to the backcountry.",
      "terrain": "All-Mountain, Big Mountain, Alpine Touring",
      "abilityLevel": "Advanced-Expert",
      "rockerType": "Rocker/Camber/Rocker",
      "turningRadius": "Short",
      "tailType": "Partial Twin Tip",
      "materials": "Metal, Wood",
      "warranty": "1 Year"
    }
  },
  {
    "productName": "Blizzard Sheeva 9 Skis - Women's",
    "price": "$649.95",
    "url": "https://www.evo.com/outlet/skis/blizzard-sheeva-9-womens-2023",
    "details": {
      "description": "The Blizzard Sheeva 9 Skis went largely undiscovered for the first few years of their existence. Then something amazing happened. It didn't snow in much of North America, and the powder oriented Sheeva 11 disciples discovered its little 92-waisted sister could rip a carve turned as well as many flat-tailed \"carver\" skis and still not humble you in bumps, re-frozen corn, and tight trees. The migration was on, and many hard chargers (including many of the evo crew) found the Sheeva 9 was the ideal tool for everyday good times.",
      "terrain": "All-Mountain",
      "abilityLevel": "Intermediate-Advanced",
      "rockerType": "Rocker/Camber/Rocker",
      "turningRadius": "Short",
      "tailType": "Partial Twin Tip",
      "materials": "Carbon, Metal, Wood",
      "warranty": "1 Year"
    }
  },
  {
    "productName": "Rossignol Experience W 80 Ca Skis ​+ Xpress 11 GW Bindings - Women's 2022",
    "price": "$699.95",
    "url": "https://www.evo.com/ski-packages/rossignol-experience-w-80-ca-skis-xpress-11-gw-bindings-womens",
    "details": {
      "description": "Get your groom on with the Rossignol Experience W 80 Ca Skis + Xpress 11 GW Bindings, a light and nimble solution to front-side skiing that turns like a dream and is versatile enough to handle a wide variety of snow conditions. Rossignol keeps the Experience W 80 light and lively, combining a featherweight Paulownia wood core with a carbon insert for energy and snap, and you'll love this ski performs on harder snow.",
      "terrain": "All-Mountain",
      "abilityLevel": "Intermediate-Advanced",
      "rockerType": "Rocker/Camber",
      "turningRadius": "Short",
      "tailType": "Flat",
      "materials": "Carbon, Wood",
      "warranty": "1 Year"
    }
  },
  {
    "productName": "Blizzard Sheeva 10 Skis - Women's",
    "price": "$699.95",
    "url": "https://www.evo.com/outlet/skis/blizzard-sheeva-10-womens-2023",
    "details": {
      "description": "The most versatile option in the remarkable Sheeva series, the Blizzard Sheeva 10 Skis split the difference in waist width between the \"11\" and the \"9\" and come up with a ski that doesn't have \"bad snow conditions\" in its vocabulary. Pow? Sure. Groomers? No problem. Chunky Monkey re-frozen mank? Oh yeah! If you're up for it, the Sheeva 10 certainly is. Carbon Fiipcore D.R.T. construction gives this ski the combination of power and forgiveness you (and everyone else) have been looking for. Join the legions of satisfied skiers who've settled on the Sheeva 10 and see what real all-mountain versatility is all about.",
      "terrain": "All-Mountain, Big Mountain",
      "abilityLevel": "Intermediate-Advanced",
      "rockerType": "Rocker/Camber/Rocker",
      "turningRadius": "Short",
      "tailType": "Partial Twin Tip",
      "materials": "Carbon, Metal, Wood",
      "warranty": "1 Year"
    }
  },
  {
    "productName": "Rossignol Experience 76 Skis ​+ Xpress 10 GW Bindings 2023",
    "price": "$479.95",
    "url": "https://www.evo.com/ski-packages/rossignol-experience-76-skis-xpress-10-gw-bindings-2022",
    "details": {
      "description": "Tired of spending an hour of your ski day waiting in line for rentals? Get the Rossignol Experience 76 Skis + Xpress 10 GW Bindings and head \"Direct To Lift\" any time you choose with confidence that your setup will perform just the way you like it each time you ski. The Experience 76 is a quality, wood core ski with a forgiving and versatile character, designed to get you up and on your way as easily as possible.",
      "terrain": "All-Mountain",
      "abilityLevel": "Beginner-Intermediate",
      "rockerType": "Rocker/Camber",
      "turningRadius": "Short",
      "tailType": "Flat",
      "materials": "Wood",
      "warranty": "1 Year"
    }
  },
  {
    "productName": "K2 Disruption 75 Alliance Skis ​+ ERP 10 Quikclik Bindings - Women's",
    "price": "$399.95",
    "url": "https://www.evo.com/outlet/ski-packages/k2-disruption-75-alliance-skis-erp-10-quikclik-bindings-womens",
    "details": {
      "description": "Click into the K2 Disruption 75 Alliance Skis + ERP 10 Quikclik Bindings with total confidence. These all-mountain focused skis allow you to develop the skills needed to tackle the next hurdle, whether that be a black diamond or a green circle. Its nimble and forgiving design will keep you coming back for more and leave you with enough energy to enjoy après.",
      "terrain": "Carving, All-Mountain",
      "abilityLevel": "Beginner-Intermediate",
      "rockerType": "Rocker/Camber/Rocker",
      "turningRadius": "Short",
      "tailType": "Flat",
      "materials": "Composite",
      "warranty": "2 Years"
    }
  },
  {
    "productName": "Rossignol Experience W 86 Basalt Skis - Women's 2022",
    "price": "$599.95",
    "url": "https://www.evo.com/skis/rossignol-experience-w-86-basalt-womens-2022",
    "details": {
      "description": "With an emphasis on light and snappy performance, the Rossignol Experience W 86 Basalt Skis are a great choice for corduroy connoisseurs who like to play in the fluffy stuff from time to time. A super light Paulownia core with Basalt Fiber for strength and dampening delivers top shelf performance without the added weight of metal, while an all mountain friendly 86mm waist width means the Experience 86 Basalt is fully capable of exploring off trail when the mood strikes.",
      "terrain": "All-Mountain",
      "abilityLevel": "Intermediate-Advanced",
      "rockerType": "Rocker/Camber",
      "turningRadius": "Short",
      "tailType": "Flat",
      "materials": "Basalt, Wood",
      "warranty": "2 Years"
    }
  },
  {
    "productName": "Salomon QST Stella 106 Skis - Women's 2023",
    "price": "$749.95",
    "url": "https://www.evo.com/skis/salomon-qst-stella-106-womens-2023",
    "details": {
      "description": "The Salomon QST Stella 106 Skis are refined perfection in a soft snow freeride tool. They're nimble, lightweight, and directional, perfect for crushing around the resort or dancing through trees in the side country. They're dependable and fun, and the level of technical detail put into them is simply astounding. Cutout sections in the tips are filled with cork for lightweight dampening, and a blend of flax and carbon fiber is placed underfoot. The full poplar core lends the stability and power needed for high speed performance, and the tapered tips and twin rocker profile keeps them loose and bouncy. Find out why so many skiers of all levels turn to the Stella 106 when there's fresh snow to be slayed!",
      "terrain": "All-Mountain",
      "abilityLevel": "Intermediate-Advanced",
      "rockerType": "Rocker/Camber/Rocker",
      "turningRadius": "Medium",
      "tailType": "Partial Twin Tip",
      "materials": "Carbon, Flax, Wood",
      "warranty": "2 Years"
    }
  },
  {
    "productName": "Atomic Maverick 83 Skis ​+ M10 GW Bindings 2023",
    "price": "$499.95",
    "url": "https://www.evo.com/ski-packages/atomic-maverick-83-skis-m-10-gw-bindings",
    "details": {
      "description": "The Atomic Maverick 83 Skis + M10 GW Bindings may be Atomic's entry-level package, but it's no slouch. The crew in Austria don't build wimpy skis; this is a legit setup built for progressing skiers, with Atomic's proprietary Flow Profile shaping to help you along. Why spend any more time in the rental line when you can just buy this ski and hit the slopes?",
      "terrain": "All-Mountain",
      "abilityLevel": "Beginner-Intermediate",
      "rockerType": "Rocker/Camber/Rocker",
      "turningRadius": "Short",
      "tailType": "Flat",
      "materials": "Wood",
      "warranty": "2 Years"
    }
  },
  {
    "productName": "Armada ARW 106 UL Skis 2023",
    "price": "$749.95",
    "url": "https://www.evo.com/skis/armada-arw-106-ul-womens",
    "details": {
      "description": "The Armada ARW 106 UL Skis are versatile, lightweight, and fun. For a great many skiers, this is the fabled one ski quiver. Wide enough for powder, narrow enough for groomers, sturdy enough for business, and playful enough for pleasure. They have Armada's freestyle twist on the all-mountain twin in the way of Smear Teach beveled tips for extra surfy buttery goodness, and they're made with an ultralight layup with that makes them very amenable to pairing with a sturdy set of touring bindings and taking to the the backcountry as well.",
      "terrain": "All-Mountain",
      "abilityLevel": "Intermediate-Advanced",
      "rockerType": "Rocker/Camber/Rocker",
      "turningRadius": "Medium",
      "tailType": "Full Twin Tip",
      "materials": "Wood",
      "warranty": "2 Years"
    }
  },
  {
    "productName": "Atomic Maverick 100 Ti Skis 2023",
    "price": "$749.95",
    "url": "https://www.evo.com/skis/atomic-maverick-100-ti-2023",
    "details": {
      "description": "If you're seeking a no speed limit, no holds barred daily driver that you can grab without wasting time to pore over the forecast, check out the Atomic Maverick 100 TI Skis. Arriving with significant design input from across the ski industry spectrum, they're built with Atomic's latest technological advancements, including the supremely balanced OMatic core and an all-new Flow Profile built for precise control in a wide array of conditions. Whether you're jamming groomer runs, powder runs, tree runs, or bump runs - seasoned pro or regular Joe - these things are the real deal!",
      "terrain": "All-Mountain",
      "abilityLevel": "Intermediate-Advanced",
      "rockerType": "Rocker/Camber/Rocker",
      "turningRadius": "Medium",
      "tailType": "Flat",
      "materials": "Metal, Wood",
      "warranty": "2 Years"
    }
  },
  {
    "productName": "Atomic Maven 86 Skis ​+ M10 GW Bindings - Women's 2023",
    "price": "$499.95",
    "url": "https://www.evo.com/ski-packages/atomic-maven-86-skis-m-10-gw-bindings-womens",
    "details": {
      "description": "Up your ski game in one fell swoop with the Atomic Maven 86 Skis + M10 GW Bindings. The latest development from one of the top companies in the business doesn't mess around, the Maven skis simply deliver smooth versatility in all snow conditions. Combining technologies from their powder skis with Atomic's smooth riding OMatic core gives the Maven 86 an edge, and the M 10 Gripwalk bindings are a natural match.",
      "terrain": "All-Mountain",
      "abilityLevel": "Intermediate-Advanced",
      "rockerType": "Rocker/Camber/Rocker",
      "turningRadius": "Short",
      "tailType": "Flat",
      "materials": "Wood",
      "warranty": "2 Years"
    }
  },
  {
    "productName": "Rossignol Experience W 78 Ca Skis ​+ Xpress 10 GW Bindings - Women's 2023",
    "price": "$579.95",
    "url": "https://www.evo.com/ski-packages/rossignol-experience-w-78-ca-skis-xpress-10-gw-bindings-womens"
  },
  {
    "productName": "Armada ARV 116 JJ Skis 2023",
    "price": "$749.95",
    "url": "https://www.evo.com/skis/armada-arv-116-jj-2023"
  },
  {
    "productName": "Armada ARV 106 Skis 2023",
    "price": "$699.95",
    "url": "https://www.evo.com/skis/armada-arv-106-2023"
  },
  {
    "productName": "Atomic Maverick 86 C Skis ​+ M10 GW Binidngs 2023",
    "price": "$599.95",
    "url": "https://www.evo.com/ski-packages/atomic-maverick-86-c-skis-m-10-gw-bindings"
  },
  {
    "productName": "Elan Ripstick Tour 104 Skis 2023",
    "price": "$799.99",
    "url": "https://www.evo.com/skis/elan-ripstick-tour-104"
  },
  {
    "productName": "Völkl Kendo 88 Skis 2023",
    "price": "$699.99",
    "url": "https://www.evo.com/skis/volkl-kendo-88-2023"
  },
  {
    "productName": "Nordica Enforcer 94 Unlimited Skis 2023",
    "price": "$799.99",
    "url": "https://www.evo.com/skis/nordica-enforcer-94-unlimited"
  },
  {
    "productName": "Rossignol Rallybird 90 Pro Skis ​+ Xpress 10W GW Bindings - Women's 2024",
    "price": "$479.95",
    "url": "https://www.evo.com/ski-packages/rossignol-rallybird-90-pro-skis-xpress-10w-gw-bindings-womens"
  },
  {
    "productName": "Armada Locator 104 Skis 2023",
    "price": "$799.95",
    "url": "https://www.evo.com/skis/armada-locator-104-2023"
  },
  {
    "productName": "Nordica Santa Ana 93 Skis - Women's 2023",
    "price": "$699.99",
    "url": "https://www.evo.com/skis/nordica-santa-ana-93-womens-2023"
  },
  {
    "productName": "Atomic Bent 85 Skis ​+ M10 GW Bindings 2023",
    "price": "$499.95",
    "url": "https://www.evo.com/ski-packages/atomic-bent-85-skis-m-10-gw-bindings"
  },
  {
    "productName": "Salomon QST Lumen 98 Skis - Women's 2023",
    "price": "$599.99",
    "url": "https://www.evo.com/skis/salomon-qst-lumen-98-womens-2023"
  },
  {
    "productName": "Line Skis Pandora 94 Skis - Women's 2023",
    "price": "$549.95",
    "url": "https://www.evo.com/skis/line-pandora-94-womens-2023"
  },
  {
    "productName": "Coalition Snow SOS Skis - Women's 2023",
    "price": "$799.00",
    "url": "https://www.evo.com/skis/coalition-snow-sos-womens"
  },
  {
    "productName": "Salomon QST 92 Skis 2023",
    "price": "$549.99",
    "url": "https://www.evo.com/skis/salomon-qst-92-2023"
  },
  {
    "productName": "Black Diamond Helio Recon 105 Skis",
    "price": "$669.95",
    "url": "https://www.evo.com/outlet/skis/black-diamond-helio-recon-105"
  },
  {
    "productName": "Blizzard Black Pearl 88 Skis - Women's 2024",
    "price": "$699.95",
    "url": "https://www.evo.com/skis/blizzard-black-pearl-88-womens"
  },
  {
    "productName": "K2 Disruption 76 Alliance Skis ​+ ERP 10 Quikclik Bindings - Women's",
    "price": "$499.95",
    "url": "https://www.evo.com/outlet/ski-packages/k2-disruption-76-alliance-skis-erp-10-quikclik-bindings-womens"
  },
  {
    "productName": "Blizzard Black Pearl 88 Skis - Women's",
    "price": "$649.95",
    "url": "https://www.evo.com/outlet/skis/blizzard-black-pearl-88-womens-2021"
  },
  {
    "productName": "Rossignol Sender 90 Pro Skis ​+ Xpress 10 GW Bindings 2023",
    "price": "$479.95",
    "url": "https://www.evo.com/ski-packages/rossignol-sender-90-pro-skis-xpress-10-gw-bindings"
  },
  {
    "productName": "Atomic Maven 83 Skis ​+ M10 GW Bindings - Women's 2023",
    "price": "$399.95",
    "url": "https://www.evo.com/ski-packages/atomic-maven-83-skis-m-10-gw-bindings-womens"
  },
  {
    "productName": "Blizzard Brahma 82 Skis",
    "price": "$599.95",
    "url": "https://www.evo.com/outlet/skis/blizzard-brahma-82-2021"
  },
  {
    "productName": "Elan Ripstick 94 Skis - Women's 2023",
    "price": "$649.99",
    "url": "https://www.evo.com/skis/elan-ripstick-94-womens"
  },
  {
    "productName": "Black Crows Camox Skis 2023",
    "price": "$799.95",
    "url": "https://www.evo.com/skis/black-crows-camox-2023"
  },
  {
    "productName": "Black Crows Atris Skis 2023",
    "price": "$899.95",
    "url": "https://www.evo.com/skis/black-crows-atris-2023"
  },
  {
    "productName": "Salomon QST Lux 92 Skis - Women's 2023",
    "price": "$549.99",
    "url": "https://www.evo.com/skis/salomon-qst-lux-92-womens-2023"
  },
  {
    "productName": "Black Crows Captis Birdie Skis - Women's 2023",
    "price": "$649.95",
    "url": "https://www.evo.com/skis/black-crows-captis-birdie-womens-2023"
  },
  {
    "productName": "K2 Reckoner 92 Skis ​+ Squire 10 Quikclik Bindings 2023",
    "price": "$399.95",
    "url": "https://www.evo.com/ski-packages/k2-reckoner-92-skis-m2-10-quikclik-bindings"
  },
  {
    "productName": "Nordica Enforcer 100 Skis 2023",
    "price": "$799.99",
    "url": "https://www.evo.com/skis/nordica-enforcer-100-2023"
  },
  {
    "productName": "Völkl Revolt 104 Skis 2023",
    "price": "$649.99",
    "url": "https://www.evo.com/skis/volkl-revolt-104-2023"
  },
  {
    "productName": "Blizzard Rustler 9 Skis",
    "price": "$649.95",
    "url": "https://www.evo.com/outlet/skis/blizzard-rustler-9-2023"
  },
  {
    "productName": "Blizzard Rustler 10 Skis",
    "price": "$749.95",
    "url": "https://www.evo.com/outlet/skis/blizzard-rustler-10-2023"
  },
  {
    "productName": "Rossignol Experience 86 Basalt Skis 2023",
    "price": "$599.95",
    "url": "https://www.evo.com/skis/rossignol-experience-86-basalt"
  },
  {
    "productName": "Season Kin Skis 2023",
    "price": "$599.00",
    "url": "https://www.evo.com/skis/season-kin"
  },
  {
    "productName": "Salomon QST Blank Skis 2023",
    "price": "$799.95",
    "url": "https://www.evo.com/skis/salomon-qst-blank-2022"
  },
  {
    "productName": "Armada Declivity 92 Ti Skis 2023",
    "price": "$699.95",
    "url": "https://www.evo.com/skis/armada-declivity-92-ti-2023"
  },
  {
    "productName": "Atomic Bent 110 Skis 2023",
    "price": "$699.95",
    "url": "https://www.evo.com/skis/atomic-bent-110-2023"
  },
  {
    "productName": "Salomon QST Lux 92 Skis - Women's",
    "price": "$499.99",
    "url": "https://www.evo.com/outlet/skis/salomon-qst-lux-92-womens-2022"
  },
  {
    "productName": "Line Skis Sick Day 104 Skis",
    "price": "$599.95",
    "url": "https://www.evo.com/outlet/skis/line-sick-day-104"
  },
  {
    "productName": "Salomon QST Lumen 99 Skis - Women's",
    "price": "$599.99",
    "url": "https://www.evo.com/outlet/skis/salomon-qst-lumen-99-womens"
  },
  {
    "productName": "Black Crows Serpo Skis 2023",
    "price": "$899.95",
    "url": "https://www.evo.com/skis/black-crows-serpo-2023"
  },
  {
    "productName": "Black Crows Captis Skis 2023",
    "price": "$649.95",
    "url": "https://www.evo.com/skis/black-crows-captis-2023"
  },
  {
    "productName": "Line Skis Pandora 104 Skis - Women's 2023",
    "price": "$649.95",
    "url": "https://www.evo.com/skis/line-pandora-104-womens-2023"
  },
  {
    "productName": "Head Kore 93 Skis 2023",
    "price": "$749.00",
    "url": "https://www.evo.com/skis/head-kore-93"
  },
  {
    "productName": "Black Diamond Helio Carbon 115 Skis",
    "price": "$949.95",
    "url": "https://www.evo.com/outlet/skis/black-diamond-helio-carbon-115"
  },
  {
    "productName": "Armada ARV 86 Skis 2023",
    "price": "$449.95",
    "url": "https://www.evo.com/skis/armada-arv-86"
  },
  {
    "productName": "Dynastar M-Free 108 Skis 2023",
    "price": "$799.95",
    "url": "https://www.evo.com/skis/dynastar-m-free-108"
  },
  {
    "productName": "Head Kore 97 Skis - Women's",
    "price": "$699.00",
    "url": "https://www.evo.com/outlet/skis/head-kore-97-w-womens"
  },
  {
    "productName": "Season Aero Skis 2023",
    "price": "$799.00",
    "url": "https://www.evo.com/skis/season-aero"
  },
  {
    "productName": "Line Skis Blade Optic 96 Skis 2023",
    "price": "$699.95",
    "url": "https://www.evo.com/skis/line-blade-optic-96-2023"
  },
  {
    "productName": "Salomon QST 106 Skis 2023",
    "price": "$749.95",
    "url": "https://www.evo.com/skis/salomon-qst-106-2023"
  },
  {
    "productName": "Blizzard Bonafide 97 Skis",
    "price": "$749.95",
    "url": "https://www.evo.com/outlet/skis/blizzard-bonafide-97-2023"
  },
  {
    "productName": "Season Nexus Skis 2023",
    "price": "$749.00",
    "url": "https://www.evo.com/skis/season-nexus"
  },
  {
    "productName": "Fischer Ranger 102 Skis 2023",
    "price": "$849.99",
    "url": "https://www.evo.com/skis/fischer-ranger-102"
  },
  {
    "productName": "Armada Short Pants Paradox Skis 2023",
    "price": "$799.95",
    "url": "https://www.evo.com/skis/armada-short-pants-paradox"
  },
  {
    "productName": "K2 Mindbender 99 Ti Skis 2023",
    "price": "$749.95",
    "url": "https://www.evo.com/skis/k2-mindbender-99ti"
  },
  {
    "productName": "Nordica Santa Ana 88 Skis - Women's 2023",
    "price": "$649.99",
    "url": "https://www.evo.com/skis/nordica-santa-ana-88-womens-2023"
  },
  {
    "productName": "Line Skis Blade Optic 92 Skis 2023",
    "price": "$549.95",
    "url": "https://www.evo.com/skis/line-blade-optic-92-2023"
  },
  {
    "productName": "K2 Mindbender 108 Ti Skis 2023",
    "price": "$799.95",
    "url": "https://www.evo.com/skis/k2-mindbender-108-ti-2023"
  },
  {
    "productName": "K2 Reckoner 92 Skis - Women's 2023",
    "price": "$299.95",
    "url": "https://www.evo.com/skis/k2-reckoner-92-womens"
  },
  {
    "productName": "Line Skis Blade Optic 104 Skis 2023",
    "price": "$749.95",
    "url": "https://www.evo.com/skis/line-blade-optic-104-2023"
  },
  {
    "productName": "Nordica Unleashed 108 Skis 2023",
    "price": "$799.99",
    "url": "https://www.evo.com/skis/nordica-unleashed-108"
  },
  {
    "productName": "Nordica Unleashed 98 Skis 2023",
    "price": "$699.99",
    "url": "https://www.evo.com/skis/nordica-unleashed-98"
  },
  {
    "productName": "Völkl Blaze 106 W Skis - Women's 2023",
    "price": "$649.99",
    "url": "https://www.evo.com/skis/volkl-blaze-106-w-womens"
  },
  {
    "productName": "Atomic Maven 93 C Skis - Women's 2023",
    "price": "$649.95",
    "url": "https://www.evo.com/skis/atomic-maven-93-c-womens-2023"
  },
  {
    "productName": "Atomic Backland 107 Skis 2023",
    "price": "$749.95",
    "url": "https://www.evo.com/skis/atomic-backland-107-2023"
  },
  {
    "productName": "Dynastar M-Free 99 Skis 2023",
    "price": "$699.95",
    "url": "https://www.evo.com/skis/dynastar-m-free-99"
  },
  {
    "productName": "Völkl Revolt 95 Skis 2023",
    "price": "$449.99",
    "url": "https://www.evo.com/skis/volkl-revolt-95"
  },
  {
    "productName": "K2 Mindbender 99 Ti Skis - Women's 2023",
    "price": "$749.95",
    "url": "https://www.evo.com/skis/k2-mindbender-99ti-womens"
  },
  {
    "productName": "Head Kore 103 Skis - Women's",
    "price": "$749.00",
    "url": "https://www.evo.com/outlet/skis/head-kore-103-w-womens"
  },
  {
    "productName": "Blizzard Hustle 10 Skis 2024",
    "price": "$799.95",
    "url": "https://www.evo.com/skis/blizzard-hustle-10"
  },
  {
    "productName": "Atomic Bent Chetler 120 Skis 2023",
    "price": "$799.95",
    "url": "https://www.evo.com/skis/atomic-bent-chetler-120-2023"
  },
  {
    "productName": "Black Crows Mirus Cor Skis 2023",
    "price": "$899.95",
    "url": "https://www.evo.com/skis/black-crows-mirus-cor-2023"
  },
  {
    "productName": "K2 Dispatch 101 Skis 2023",
    "price": "$899.95",
    "url": "https://www.evo.com/skis/k2-dispatch-101-2023"
  },
  {
    "productName": "Blizzard Hustle 9 Skis 2024",
    "price": "$749.95",
    "url": "https://www.evo.com/skis/blizzard-hustle-9"
  },
  {
    "productName": "Blizzard Rustler 11 Skis",
    "price": "$799.95",
    "url": "https://www.evo.com/outlet/skis/blizzard-rustler-11-2023"
  },
  {
    "productName": "Rossignol Sender 106 Ti Plus Skis 2023",
    "price": "$899.95",
    "url": "https://www.evo.com/skis/rossignol-sender-106-ti-plus"
  },
  {
    "productName": "K2 Poacher Jr Skis ​+ FDT 7.0 Bindings - Kids' 2023",
    "price": "$369.95",
    "url": "https://www.evo.com/ski-packages/k2-poacher-jr-skis-fdt-70-bindings-kids"
  },
  {
    "productName": "Line Skis Chronic Skis 2023",
    "price": "$549.95",
    "url": "https://www.evo.com/skis/line-chronic"
  },
  {
    "productName": "K2 Mindbender 116 C Skis 2023",
    "price": "$749.95",
    "url": "https://www.evo.com/skis/k2-mindbender-116-c-2023"
  },
  {
    "productName": "Line Skis Tom Wallisch Pro Skis 2023",
    "price": "$499.95",
    "url": "https://www.evo.com/skis/line-tom-wallisch-pro-2023"
  },
  {
    "productName": "Rossignol Experience 78 C Skis ​+ Xpress 10 GW Bindings 2023",
    "price": "$579.95",
    "url": "https://www.evo.com/ski-packages/rossignol-experience-78-c-skis-xpress-11-gw-bindings"
  },
  {
    "productName": "K2 Mindbender 90 C Skis - Women's 2023",
    "price": "$499.95",
    "url": "https://www.evo.com/skis/k2-mindbender-90-c-womens"
  },
  {
    "productName": "Blizzard Black Pearl 82 Skis - Women's 2024",
    "price": "$649.95",
    "url": "https://www.evo.com/skis/blizzard-black-pearl-82-womens"
  },
  {
    "productName": "Armada ARW 86 Skis - Women's 2023",
    "price": "$449.95",
    "url": "https://www.evo.com/skis/armada-arw-86-womens"
  },
  {
    "productName": "Armada Reliance 92 Ti Skis - Women's 2023",
    "price": "$699.95",
    "url": "https://www.evo.com/skis/armada-reliance-92-ti-womens-2022"
  },
  {
    "productName": "Armada Reliance 102 Ti Skis - Women's 2023",
    "price": "$799.95",
    "url": "https://www.evo.com/skis/armada-reliance-102-ti-womens"
  },
  {
    "productName": "Head Kore 105 Skis 2023",
    "price": "$799.00",
    "url": "https://www.evo.com/skis/head-kore-105"
  },
  {
    "productName": "Rossignol Black Ops 92 Skis ​+ Xpress 11 GW Bindings - Women's 2023",
    "price": "$649.95",
    "url": "https://www.evo.com/ski-packages/rossignol-black-ops-92-skis-xpress-11-gw-bindings-womens"
  },
  {
    "productName": "Atomic Maverick 95 Ti Skis 2023",
    "price": "$699.95",
    "url": "https://www.evo.com/skis/atomic-maverick-95-ti-2023"
  },
  {
    "productName": "Armada Locator 112 Skis 2023",
    "price": "$849.95",
    "url": "https://www.evo.com/skis/armada-locator-112"
  },
  {
    "productName": "K2 Dispatch 110 Skis 2023",
    "price": "$899.95",
    "url": "https://www.evo.com/skis/k2-dispatch-110-2023"
  },
  {
    "productName": "Rossignol Black Ops 118 Skis 2023",
    "price": "$849.95",
    "url": "https://www.evo.com/skis/rossignol-black-ops-118"
  },
  {
    "productName": "Blizzard Sheeva 11 Skis - Women's",
    "price": "$749.95",
    "url": "https://www.evo.com/outlet/skis/blizzard-sheeva-11-womens-2023"
  },
  {
    "productName": "Völkl Blaze 94 W Skis - Women's 2023",
    "price": "$599.99",
    "url": "https://www.evo.com/skis/volkl-blaze-94-w-womens"
  },
  {
    "productName": "Blizzard Hustle 11 Skis 2024",
    "price": "$849.95",
    "url": "https://www.evo.com/skis/blizzard-hustle-11"
  },
  {
    "productName": "Season Forma Skis 2023",
    "price": "$899.00",
    "url": "https://www.evo.com/skis/season-forma"
  },
  {
    "productName": "Armada Stranger Skis 2023",
    "price": "$749.95",
    "url": "https://www.evo.com/skis/armada-stranger"
  },
  {
    "productName": "ZAG Slap 104 Skis 2023",
    "price": "$849.00",
    "url": "https://www.evo.com/skis/zag-slap-104"
  },
  {
    "productName": "Season Forma Skis",
    "price": "$749.00",
    "url": "https://www.evo.com/outlet/skis/season-forma-2021"
  },
  {
    "productName": "Head Kore 99 Skis 2023",
    "price": "$799.00",
    "url": "https://www.evo.com/skis/head-kore-99"
  },
  {
    "productName": "Faction Mana 3 Skis 2023",
    "price": "$799.00",
    "url": "https://www.evo.com/skis/faction-mana-3-2023"
  },
  {
    "productName": "Atomic Redster Q4 Skis ​+ M 10 GW Bindings 2023",
    "price": "$499.95",
    "url": "https://www.evo.com/ski-packages/atomic-redster-q4-skis-m-10-gw-bindings"
  },
  {
    "productName": "Armada ARV 116 JJ UL Skis 2023",
    "price": "$799.95",
    "url": "https://www.evo.com/skis/armada-arv-116-jj-ul"
  },
  {
    "productName": "Rossignol Experience W 76 Skis ​+ Xpress 10 GW Bindings - Women's 2023",
    "price": "$479.95",
    "url": "https://www.evo.com/ski-packages/rossignol-experience-w-76-skis-xpress-10-gw-bindings-womens"
  },
  {
    "productName": "Armada Edollo Skis 2023",
    "price": "$649.95",
    "url": "https://www.evo.com/skis/armada-edollo-2023"
  },
  {
    "productName": "Dynastar M-Free 90 Skis 2023",
    "price": "$529.95",
    "url": "https://www.evo.com/skis/dynastar-m-free-90"
  },
  {
    "productName": "Rossignol Rallybird 102 Skis - Women's 2023",
    "price": "$749.95",
    "url": "https://www.evo.com/skis/rossignol-rallybird-102-womens"
  },
  {
    "productName": "Dynastar M-Pro 90 Skis 2023",
    "price": "$699.95",
    "url": "https://www.evo.com/skis/dynastar-m-pro-90"
  },
  {
    "productName": "RMU Valhalla 107 Skis - Women's 2023",
    "price": "$799.00",
    "url": "https://www.evo.com/skis/rmu-valhalla-107-womens"
  },
  {
    "productName": "Völkl Revolt 81 Skis 2023",
    "price": "$349.99",
    "url": "https://www.evo.com/skis/volkl-revolt-81"
  },
  {
    "productName": "K2 Mindbender 89 Ti Skis - Women's 2023",
    "price": "$699.95",
    "url": "https://www.evo.com/skis/k2-mindbender-89-ti-womens"
  },
  {
    "productName": "Völkl Katana 108 Skis 2023",
    "price": "$849.99",
    "url": "https://www.evo.com/skis/volkl-katana-108-2023"
  },
  {
    "productName": "Atomic Bent 90 Skis 2024",
    "price": "$549.95",
    "url": "https://www.evo.com/skis/atomic-bent-90"
  },
  {
    "productName": "Atomic Bent 100 Skis 2024",
    "price": "$649.95",
    "url": "https://www.evo.com/skis/atomic-bent-100"
  },
  {
    "productName": "K2 Fatty Skis 2023",
    "price": "$239.95",
    "url": "https://www.evo.com/skis/k2-fatty"
  },
  {
    "productName": "Atomic Bent 110 Skis 2024",
    "price": "$749.95",
    "url": "https://www.evo.com/skis/atomic-bent-110"
  },
  {
    "productName": "Armada ARW 88 Skis - Women's 2024",
    "price": "$549.95",
    "url": "https://www.evo.com/skis/armada-arw-88-womens"
  },
  {
    "productName": "Armada ARV 88 Skis 2024",
    "price": "$549.95",
    "url": "https://www.evo.com/skis/armada-arv-88"
  },
  {
    "productName": "Black Crows Atris Birdie Skis - Women's 2024",
    "price": "$899.95",
    "url": "https://www.evo.com/skis/black-crows-atris-birdie-womens"
  },
  {
    "productName": "Armada ARV 100 Skis 2024",
    "price": "$699.95",
    "url": "https://www.evo.com/skis/armada-arv-100"
  },
  {
    "productName": "Völkl Deacon Junior Skis ​+ 7.0 vMotion Jr Bindings - Kids' 2024",
    "price": "$299.99",
    "url": "https://www.evo.com/ski-packages/volkl-deacon-junior-skis-70-vmotion-jr-bindings-kids"
  },
  {
    "productName": "Völkl Deacon Junior Skis ​+ 4.5 vMotion Jr Bindings - Kids' 2024",
    "price": "$269.99",
    "url": "https://www.evo.com/ski-packages/volkl-deacon-junior-skis-45-vmotion-jr-bindings-kids"
  },
  {
    "productName": "Völkl Revolt Jr Wasp Skis ​+ vMotion 4.5 GW Bindings - Kids' 2024",
    "price": "$329.99",
    "url": "https://www.evo.com/ski-packages/volkl-revolt-jr-wasp-skis-vmotion-45-gw-bindings-kids"
  },
  {
    "productName": "Völkl Revolt 86 Scorpion Skis - Kids' 2024",
    "price": "$399.99",
    "url": "https://www.evo.com/skis/volkl-revolt-86-scorpion-kids"
  },
  {
    "productName": "Völkl M6 Mantra Skis 2024",
    "price": "$749.99",
    "url": "https://www.evo.com/skis/volkl-m6-mantra"
  },
  {
    "productName": "Völkl Revolt Jr Hopper Skis ​+ vMotion 7.0 GW Bindings - Kids' 2024",
    "price": "$349.99",
    "url": "https://www.evo.com/ski-packages/volkl-revolt-jr-hopper-skis-vmotion-70-gw-bindings-kids"
  },
  {
    "productName": "Völkl Revolt Jr Wasp Skis ​+ vMotion 7.0 GW Bindings - Kids' 2024",
    "price": "$349.99",
    "url": "https://www.evo.com/ski-packages/volkl-revolt-jr-wasp-skis-vmotion-70-gw-bindings-kids"
  },
  {
    "productName": "Völkl Revolt Jr Hopper Skis ​+ vMotion 4.5 GW Bindings - Kids' 2024",
    "price": "$329.99",
    "url": "https://www.evo.com/ski-packages/volkl-revolt-jr-hopper-skis-vmotion-45-gw-bindings-kids"
  },
  {
    "productName": "Armada Locator 88 Skis 2023",
    "price": "$649.95",
    "url": "https://www.evo.com/skis/armada-locator-88"
  }
]